/* automatically generated by rust-bindgen 0.59.1 */

pub const _SYS_TIME_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 33;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LDOUBLE_REDIRECTS_TO_FLOAT128_ABI: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const _BITS_TYPES_H: u32 = 1;
pub const __TIMESIZE: u32 = 64;

pub const GL_RESTART_SUN: u32 = 1;
pub const GL_REPLACE_MIDDLE_SUN: u32 = 2;
pub const GL_REPLACE_OLDEST_SUN: u32 = 3;
pub const GL_TRIANGLE_LIST_SUN: u32 = 33239;
pub const GL_REPLACEMENT_CODE_SUN: u32 = 33240;
pub const GL_REPLACEMENT_CODE_ARRAY_SUN: u32 = 34240;
pub const GL_REPLACEMENT_CODE_ARRAY_TYPE_SUN: u32 = 34241;
pub const GL_REPLACEMENT_CODE_ARRAY_STRIDE_SUN: u32 = 34242;
pub const GL_REPLACEMENT_CODE_ARRAY_POINTER_SUN: u32 = 34243;
pub const GL_R1UI_V3F_SUN: u32 = 34244;
pub const GL_R1UI_C4UB_V3F_SUN: u32 = 34245;
pub const GL_R1UI_C3F_V3F_SUN: u32 = 34246;
pub const GL_R1UI_N3F_V3F_SUN: u32 = 34247;
pub const GL_R1UI_C4F_N3F_V3F_SUN: u32 = 34248;
pub const GL_R1UI_T2F_V3F_SUN: u32 = 34249;
pub const GL_R1UI_T2F_N3F_V3F_SUN: u32 = 34250;
pub const GL_R1UI_T2F_C4F_N3F_V3F_SUN: u32 = 34251;
pub const GL_SUN_vertex: u32 = 1;
pub const GL_WIN_phong_shading: u32 = 1;
pub const GL_PHONG_WIN: u32 = 33002;
pub const GL_PHONG_HINT_WIN: u32 = 33003;
pub const GL_WIN_specular_fog: u32 = 1;
pub const GL_FOG_SPECULAR_TEXTURE_WIN: u32 = 33004;
pub const GL_MESA_packed_depth_stencil: u32 = 1;
pub const GL_DEPTH_STENCIL_MESA: u32 = 34640;
pub const GL_UNSIGNED_INT_24_8_MESA: u32 = 34641;
pub const GL_UNSIGNED_INT_8_24_REV_MESA: u32 = 34642;
pub const GL_UNSIGNED_SHORT_15_1_MESA: u32 = 34643;
pub const GL_UNSIGNED_SHORT_1_15_REV_MESA: u32 = 34644;
pub const GL_ATI_blend_equation_separate: u32 = 1;
pub const GL_ALPHA_BLEND_EQUATION_ATI: u32 = 34877;
pub const GL_OES_EGL_image: u32 = 1;
pub type __u_char = ctypes::c_uchar;
pub type __u_short = ctypes::c_ushort;
pub type __u_int = ctypes::c_uint;
pub type __u_long = ctypes::c_ulong;
pub type __int8_t = ctypes::c_schar;
pub type __uint8_t = ctypes::c_uchar;
pub type __int16_t = ctypes::c_short;
pub type __uint16_t = ctypes::c_ushort;
pub type __int32_t = ctypes::c_int;
pub type __uint32_t = ctypes::c_uint;
pub type __int64_t = ctypes::c_long;
pub type __uint64_t = ctypes::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ctypes::c_long;
pub type __u_quad_t = ctypes::c_ulong;
pub type __intmax_t = ctypes::c_long;
pub type __uintmax_t = ctypes::c_ulong;
pub type __dev_t = ctypes::c_ulong;
pub type __uid_t = ctypes::c_uint;
pub type __gid_t = ctypes::c_uint;
pub type __ino_t = ctypes::c_ulong;
pub type __ino64_t = ctypes::c_ulong;
pub type __mode_t = ctypes::c_uint;
pub type __nlink_t = ctypes::c_ulong;
pub type __off_t = ctypes::c_long;
pub type __off64_t = ctypes::c_long;
pub type __pid_t = ctypes::c_int;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [ctypes::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ctypes::c_long;
pub type __rlim_t = ctypes::c_ulong;
pub type __rlim64_t = ctypes::c_ulong;
pub type __id_t = ctypes::c_uint;
pub type __time_t = ctypes::c_long;
pub type __useconds_t = ctypes::c_uint;
pub type __suseconds_t = ctypes::c_long;
pub type __suseconds64_t = ctypes::c_long;
pub type __daddr_t = ctypes::c_int;
pub type __key_t = ctypes::c_int;
pub type __clockid_t = ctypes::c_int;
pub type __timer_t = *mut ctypes::c_void;
pub type __blksize_t = ctypes::c_long;
pub type __blkcnt_t = ctypes::c_long;
pub type __blkcnt64_t = ctypes::c_long;
pub type __fsblkcnt_t = ctypes::c_ulong;
pub type __fsblkcnt64_t = ctypes::c_ulong;
pub type __fsfilcnt_t = ctypes::c_ulong;
pub type __fsfilcnt64_t = ctypes::c_ulong;
pub type __fsword_t = ctypes::c_long;
pub type __ssize_t = ctypes::c_long;
pub type __syscall_slong_t = ctypes::c_long;
pub type __syscall_ulong_t = ctypes::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ctypes::c_char;
pub type __intptr_t = ctypes::c_long;
pub type __socklen_t = ctypes::c_uint;
pub type __sig_atomic_t = ctypes::c_int;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::core::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [ctypes::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::core::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = ctypes::c_long;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::core::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::core::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ctypes::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ctypes::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ctypes::c_int;
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ctypes::c_int,
    pub tz_dsttime: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    assert_eq!(
        ::core::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::core::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timezone>())).tz_minuteswest as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<timezone>())).tz_dsttime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
extern "C" {
    pub fn gettimeofday(__tv: *mut timeval, __tz: *mut ctypes::c_void) -> ctypes::c_int;
}
extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ctypes::c_int;
}
extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ctypes::c_int;
}
pub const ITIMER_REAL: __itimer_which = 0;
pub const ITIMER_VIRTUAL: __itimer_which = 1;
pub const ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = ctypes::c_uint;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    assert_eq!(
        ::core::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::core::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<itimerval>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<itimerval>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
pub type __itimer_which_t = ctypes::c_int;
extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ctypes::c_int;
}
extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn utimes(__file: *const ctypes::c_char, __tvp: *const timeval) -> ctypes::c_int;
}
extern "C" {
    pub fn lutimes(__file: *const ctypes::c_char, __tvp: *const timeval) -> ctypes::c_int;
}
extern "C" {
    pub fn futimes(__fd: ctypes::c_int, __tvp: *const timeval) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetPlatform() -> *const ctypes::c_char;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type size_t = ctypes::c_ulong;
pub type ulong = ctypes::c_ulong;
pub type ushort = ctypes::c_ushort;
pub type uint = ctypes::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ctypes::c_long;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_list {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ctypes::c_int,
    pub __count: ctypes::c_uint,
    pub __owner: ctypes::c_int,
    pub __nusers: ctypes::c_uint,
    pub __kind: ctypes::c_int,
    pub __spins: ctypes::c_short,
    pub __elision: ctypes::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ctypes::c_uint,
    pub __writers: ctypes::c_uint,
    pub __wrphase_futex: ctypes::c_uint,
    pub __writers_futex: ctypes::c_uint,
    pub __pad3: ctypes::c_uint,
    pub __pad4: ctypes::c_uint,
    pub __cur_writer: ctypes::c_int,
    pub __shared: ctypes::c_int,
    pub __rwelision: ctypes::c_schar,
    pub __pad1: [ctypes::c_uchar; 7usize],
    pub __pad2: ctypes::c_ulong,
    pub __flags: ctypes::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [ctypes::c_uint; 2usize],
    pub __g_size: [ctypes::c_uint; 2usize],
    pub __g1_orig_size: ctypes::c_uint,
    pub __wrefs: ctypes::c_uint,
    pub __g_signals: [ctypes::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ctypes::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ctypes::c_uint,
    pub __high: ctypes::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ctypes::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ctypes::c_uint,
    pub __high: ctypes::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::core::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::core::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
impl Default for __pthread_cond_s {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __tss_t = ctypes::c_uint;
pub type __thrd_t = ctypes::c_ulong;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct __once_flag {
    pub __data: ctypes::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::core::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::core::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ctypes::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [ctypes::c_char; 4usize],
    pub __align: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [ctypes::c_char; 4usize],
    pub __align: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_condattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_key_t = ctypes::c_uint;
pub type pthread_once_t = ctypes::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [ctypes::c_char; 56usize],
    pub __align: ctypes::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_attr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [ctypes::c_char; 40usize],
    pub __align: ctypes::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [ctypes::c_char; 48usize],
    pub __align: ctypes::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_cond_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [ctypes::c_char; 56usize],
    pub __align: ctypes::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [ctypes::c_char; 8usize],
    pub __align: ctypes::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_spinlock_t = ctypes::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [ctypes::c_char; 32usize],
    pub __align: ctypes::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrier_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [ctypes::c_char; 4usize],
    pub __align: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::core::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ctypes::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ctypes::c_uint,
    pub __wchb: [ctypes::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
impl Default for __mbstate_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::core::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
impl Default for __mbstate_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::core::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
impl Default for _G_fpos_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::core::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
impl Default for _G_fpos64_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ctypes::c_void;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ctypes::c_int,
    pub _IO_read_ptr: *mut ctypes::c_char,
    pub _IO_read_end: *mut ctypes::c_char,
    pub _IO_read_base: *mut ctypes::c_char,
    pub _IO_write_base: *mut ctypes::c_char,
    pub _IO_write_ptr: *mut ctypes::c_char,
    pub _IO_write_end: *mut ctypes::c_char,
    pub _IO_buf_base: *mut ctypes::c_char,
    pub _IO_buf_end: *mut ctypes::c_char,
    pub _IO_save_base: *mut ctypes::c_char,
    pub _IO_backup_base: *mut ctypes::c_char,
    pub _IO_save_end: *mut ctypes::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ctypes::c_int,
    pub _flags2: ctypes::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ctypes::c_ushort,
    pub _vtable_offset: ctypes::c_schar,
    pub _shortbuf: [ctypes::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ctypes::c_void,
    pub __pad5: size_t,
    pub _mode: ctypes::c_int,
    pub _unused2: [ctypes::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::core::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::core::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
impl Default for _IO_FILE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn rename(__old: *const ctypes::c_char, __new: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ctypes::c_int,
        __old: *const ctypes::c_char,
        __newfd: ctypes::c_int,
        __new: *const ctypes::c_char,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ctypes::c_char,
        __pfx: *const ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const ctypes::c_char, __modes: *const ctypes::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ctypes::c_char,
        __modes: *const ctypes::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ctypes::c_int, __modes: *const ctypes::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ctypes::c_void,
        __len: size_t,
        __modes: *const ctypes::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut ctypes::c_char, __sizeloc: *mut size_t) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ctypes::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ctypes::c_char,
        __modes: ctypes::c_int,
        __n: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ctypes::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE, __format: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn printf(__format: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut ctypes::c_char, __format: *const ctypes::c_char, ...)
        -> ctypes::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const ctypes::c_char, __arg: *mut __va_list_tag) -> ctypes::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ctypes::c_char,
        __format: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ctypes::c_char,
        __maxlen: ctypes::c_ulong,
        __format: *const ctypes::c_char,
        ...
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ctypes::c_char,
        __maxlen: ctypes::c_ulong,
        __format: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ctypes::c_int,
        __fmt: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn dprintf(__fd: ctypes::c_int, __fmt: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE, __format: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ctypes::c_char,
        __format: *const ctypes::c_char,
        ...
    ) -> ctypes::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE, __format: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ctypes::c_char,
        __format: *const ctypes::c_char,
        ...
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const ctypes::c_char, __arg: *mut __va_list_tag) -> ctypes::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ctypes::c_char,
        __format: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(__format: *const ctypes::c_char, __arg: *mut __va_list_tag) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ctypes::c_char,
        __format: *const ctypes::c_char,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn getchar() -> ctypes::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ctypes::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn fputc(__c: ctypes::c_int, __stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn putc(__c: ctypes::c_int, __stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn putchar(__c: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ctypes::c_int, __stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ctypes::c_int, __stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn putw(__w: ctypes::c_int, __stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ctypes::c_char,
        __n: ctypes::c_int,
        __stream: *mut FILE,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ctypes::c_char,
        __n: *mut size_t,
        __delimiter: ctypes::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ctypes::c_char,
        __n: *mut size_t,
        __delimiter: ctypes::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ctypes::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ctypes::c_char, __stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn puts(__s: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn ungetc(__c: ctypes::c_int, __stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ctypes::c_void,
        __size: ctypes::c_ulong,
        __n: ctypes::c_ulong,
        __stream: *mut FILE,
    ) -> ctypes::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ctypes::c_void,
        __size: ctypes::c_ulong,
        __n: ctypes::c_ulong,
        __s: *mut FILE,
    ) -> ctypes::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ctypes::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ctypes::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ctypes::c_long,
        __whence: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ctypes::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t, __whence: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ctypes::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ctypes::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn perror(__s: *const ctypes::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn popen(__command: *const ctypes::c_char, __modes: *const ctypes::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ctypes::c_int) -> ctypes::c_int;
}
pub type wchar_t = ctypes::c_int;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct div_t {
    pub quot: ctypes::c_int,
    pub rem: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::core::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ctypes::c_long,
    pub rem: ctypes::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ctypes::c_longlong,
    pub rem: ctypes::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ctypes::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ctypes::c_char) -> ctypes::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ctypes::c_char) -> ctypes::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const ctypes::c_char, __endptr: *mut *mut ctypes::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const ctypes::c_char, __endptr: *mut *mut ctypes::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const ctypes::c_char, __endptr: *mut *mut ctypes::c_char) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> ctypes::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> ctypes::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> ctypes::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> ctypes::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> ctypes::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> ctypes::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ctypes::c_long) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ctypes::c_char) -> ctypes::c_long;
}
extern "C" {
    pub fn random() -> ctypes::c_long;
}
extern "C" {
    pub fn srandom(__seed: ctypes::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ctypes::c_uint,
        __statebuf: *mut ctypes::c_char,
        __statelen: size_t,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ctypes::c_int,
    pub rand_deg: ctypes::c_int,
    pub rand_sep: ctypes::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::core::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::core::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
impl Default for random_data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ctypes::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: ctypes::c_uint, __buf: *mut random_data) -> ctypes::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ctypes::c_uint,
        __statebuf: *mut ctypes::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut ctypes::c_char, __buf: *mut random_data) -> ctypes::c_int;
}
extern "C" {
    pub fn rand() -> ctypes::c_int;
}
extern "C" {
    pub fn srand(__seed: ctypes::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ctypes::c_uint) -> ctypes::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ctypes::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ctypes::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ctypes::c_ushort) -> ctypes::c_long;
}
extern "C" {
    pub fn mrand48() -> ctypes::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ctypes::c_ushort) -> ctypes::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ctypes::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ctypes::c_ushort) -> *mut ctypes::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ctypes::c_ushort);
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct drand48_data {
    pub __x: [ctypes::c_ushort; 3usize],
    pub __old_x: [ctypes::c_ushort; 3usize],
    pub __c: ctypes::c_ushort,
    pub __init: ctypes::c_ushort,
    pub __a: ctypes::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::core::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::core::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ctypes::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ctypes::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data, __result: *mut ctypes::c_long) -> ctypes::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ctypes::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ctypes::c_long,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data, __result: *mut ctypes::c_long) -> ctypes::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ctypes::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ctypes::c_long,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: ctypes::c_long, __buffer: *mut drand48_data) -> ctypes::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut ctypes::c_ushort, __buffer: *mut drand48_data)
        -> ctypes::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut ctypes::c_ushort, __buffer: *mut drand48_data) -> ctypes::c_int;
}
extern "C" {
    pub fn malloc(__size: ctypes::c_ulong) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: ctypes::c_ulong, __size: ctypes::c_ulong) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut ctypes::c_void, __size: ctypes::c_ulong) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ctypes::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ctypes::c_void);
}
extern "C" {
    pub fn alloca(__size: ctypes::c_ulong) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ctypes::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> ctypes::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func: ::core::option::Option<unsafe extern "C" fn()>) -> ctypes::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::core::option::Option<
            unsafe extern "C" fn(__status: ctypes::c_int, __arg: *mut ctypes::c_void),
        >,
        __arg: *mut ctypes::c_void,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn exit(__status: ctypes::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ctypes::c_int);
}
extern "C" {
    pub fn _Exit(__status: ctypes::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ctypes::c_char,
        __value: *const ctypes::c_char,
        __replace: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn clearenv() -> ctypes::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut ctypes::c_char, __suffixlen: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn system(__command: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ctypes::c_char,
        __resolved: *mut ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
pub type __compar_fn_t = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const ctypes::c_void, arg2: *const ctypes::c_void) -> ctypes::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ctypes::c_void,
        __base: *const ctypes::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ctypes::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn labs(__x: ctypes::c_long) -> ctypes::c_long;
}
extern "C" {
    pub fn llabs(__x: ctypes::c_longlong) -> ctypes::c_longlong;
}
extern "C" {
    pub fn div(__numer: ctypes::c_int, __denom: ctypes::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ctypes::c_long, __denom: ctypes::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: ctypes::c_longlong, __denom: ctypes::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ctypes::c_int,
        __buf: *mut ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ctypes::c_int,
        __buf: *mut ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
        __buf: *mut ctypes::c_char,
        __len: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
        __buf: *mut ctypes::c_char,
        __len: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
        __buf: *mut ctypes::c_char,
        __len: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ctypes::c_int,
        __decpt: *mut ctypes::c_int,
        __sign: *mut ctypes::c_int,
        __buf: *mut ctypes::c_char,
        __len: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ctypes::c_char, __n: size_t) -> ctypes::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const ctypes::c_char, __n: size_t) -> ctypes::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ctypes::c_char, __wchar: wchar_t) -> ctypes::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ctypes::c_char, __n: size_t) -> size_t;
}
extern "C" {
    pub fn wcstombs(__s: *mut ctypes::c_char, __pwcs: *const wchar_t, __n: size_t) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ctypes::c_char,
        __tokens: *const *mut ctypes::c_char,
        __valuep: *mut *mut ctypes::c_char,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ctypes::c_int) -> ctypes::c_int;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ctypes::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ctypes::c_void,
        __src: *const ctypes::c_void,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ctypes::c_void,
        __src: *const ctypes::c_void,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ctypes::c_void,
        __src: *const ctypes::c_void,
        __c: ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ctypes::c_void,
        __c: ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ctypes::c_void,
        __s2: *const ctypes::c_void,
        __n: ctypes::c_ulong,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ctypes::c_void,
        __c: ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut ctypes::c_char, __src: *const ctypes::c_char)
        -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ctypes::c_char,
        __src: *const ctypes::c_char,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut ctypes::c_char, __src: *const ctypes::c_char)
        -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ctypes::c_char,
        __src: *const ctypes::c_char,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const ctypes::c_char, __s2: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ctypes::c_char,
        __s2: *const ctypes::c_char,
        __n: ctypes::c_ulong,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const ctypes::c_char, __s2: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ctypes::c_char,
        __src: *const ctypes::c_char,
        __n: ctypes::c_ulong,
    ) -> ctypes::c_ulong;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ctypes::c_ushort,
    pub __ctype_tolower: *const ctypes::c_int,
    pub __ctype_toupper: *const ctypes::c_int,
    pub __names: [*const ctypes::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::core::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::core::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
impl Default for __locale_struct {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ctypes::c_char,
        __s2: *const ctypes::c_char,
        __l: locale_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ctypes::c_char,
        __src: *const ctypes::c_char,
        __n: size_t,
        __l: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strndup(__string: *const ctypes::c_char, __n: ctypes::c_ulong) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strchr(__s: *const ctypes::c_char, __c: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const ctypes::c_char, __c: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const ctypes::c_char, __reject: *const ctypes::c_char) -> ctypes::c_ulong;
}
extern "C" {
    pub fn strspn(__s: *const ctypes::c_char, __accept: *const ctypes::c_char) -> ctypes::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ctypes::c_char,
        __accept: *const ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ctypes::c_char,
        __needle: *const ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut ctypes::c_char, __delim: *const ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ctypes::c_char,
        __delim: *const ctypes::c_char,
        __save_ptr: *mut *mut ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ctypes::c_char,
        __delim: *const ctypes::c_char,
        __save_ptr: *mut *mut ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ctypes::c_char) -> ctypes::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ctypes::c_char, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn strerror(__errnum: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ctypes::c_int,
        __buf: *mut ctypes::c_char,
        __buflen: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: ctypes::c_int, __l: locale_t) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ctypes::c_void,
        __s2: *const ctypes::c_void,
        __n: ctypes::c_ulong,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn bcopy(__src: *const ctypes::c_void, __dest: *mut ctypes::c_void, __n: size_t);
}
extern "C" {
    pub fn bzero(__s: *mut ctypes::c_void, __n: ctypes::c_ulong);
}
extern "C" {
    pub fn index(__s: *const ctypes::c_char, __c: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn rindex(__s: *const ctypes::c_char, __c: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn ffs(__i: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn ffsl(__l: ctypes::c_long) -> ctypes::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ctypes::c_longlong) -> ctypes::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const ctypes::c_char, __s2: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ctypes::c_char,
        __s2: *const ctypes::c_char,
        __n: ctypes::c_ulong,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ctypes::c_char,
        __s2: *const ctypes::c_char,
        __loc: locale_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ctypes::c_char,
        __s2: *const ctypes::c_char,
        __n: size_t,
        __loc: locale_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ctypes::c_void, __n: size_t);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ctypes::c_char,
        __delim: *const ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ctypes::c_char,
        __src: *const ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut ctypes::c_char, __src: *const ctypes::c_char)
        -> *mut ctypes::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ctypes::c_char,
        __src: *const ctypes::c_char,
        __n: size_t,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ctypes::c_char,
        __src: *const ctypes::c_char,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_char;
}
pub type wint_t = ctypes::c_uint;
pub type mbstate_t = __mbstate_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wcscpy(__dest: *mut wchar_t, __src: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncpy(__dest: *mut wchar_t, __src: *const wchar_t, __n: size_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscat(__dest: *mut wchar_t, __src: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncat(__dest: *mut wchar_t, __src: *const wchar_t, __n: size_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(__s1: *const ctypes::c_int, __s2: *const ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn wcsncmp(
        __s1: *const ctypes::c_int,
        __s2: *const ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn wcscasecmp(__s1: *const wchar_t, __s2: *const wchar_t) -> ctypes::c_int;
}
extern "C" {
    pub fn wcsncasecmp(__s1: *const wchar_t, __s2: *const wchar_t, __n: size_t) -> ctypes::c_int;
}
extern "C" {
    pub fn wcscasecmp_l(
        __s1: *const wchar_t,
        __s2: *const wchar_t,
        __loc: locale_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn wcsncasecmp_l(
        __s1: *const wchar_t,
        __s2: *const wchar_t,
        __n: size_t,
        __loc: locale_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn wcscoll(__s1: *const wchar_t, __s2: *const wchar_t) -> ctypes::c_int;
}
extern "C" {
    pub fn wcsxfrm(__s1: *mut wchar_t, __s2: *const wchar_t, __n: size_t) -> size_t;
}
extern "C" {
    pub fn wcscoll_l(__s1: *const wchar_t, __s2: *const wchar_t, __loc: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn wcsxfrm_l(
        __s1: *mut wchar_t,
        __s2: *const wchar_t,
        __n: size_t,
        __loc: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcsdup(__s: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcschr(__wcs: *const ctypes::c_int, __wc: ctypes::c_int) -> *mut ctypes::c_int;
}
extern "C" {
    pub fn wcsrchr(__wcs: *const wchar_t, __wc: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscspn(__wcs: *const wchar_t, __reject: *const wchar_t) -> size_t;
}
extern "C" {
    pub fn wcsspn(__wcs: *const wchar_t, __accept: *const wchar_t) -> size_t;
}
extern "C" {
    pub fn wcspbrk(__wcs: *const wchar_t, __accept: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsstr(__haystack: *const wchar_t, __needle: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstok(
        __s: *mut wchar_t,
        __delim: *const wchar_t,
        __ptr: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcslen(__s: *const ctypes::c_int) -> ctypes::c_ulong;
}
extern "C" {
    pub fn wcsnlen(__s: *const wchar_t, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn wmemchr(
        __s: *const ctypes::c_int,
        __c: ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_int;
}
extern "C" {
    pub fn wmemcmp(
        __s1: *const ctypes::c_int,
        __s2: *const ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn wmemcpy(
        __s1: *mut ctypes::c_int,
        __s2: *const ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_int;
}
extern "C" {
    pub fn wmemmove(
        __s1: *mut ctypes::c_int,
        __s2: *const ctypes::c_int,
        __n: ctypes::c_ulong,
    ) -> *mut ctypes::c_int;
}
extern "C" {
    pub fn wmemset(__s: *mut wchar_t, __c: wchar_t, __n: size_t) -> *mut wchar_t;
}
extern "C" {
    pub fn btowc(__c: ctypes::c_int) -> wint_t;
}
extern "C" {
    pub fn wctob(__c: wint_t) -> ctypes::c_int;
}
extern "C" {
    pub fn mbsinit(__ps: *const mbstate_t) -> ctypes::c_int;
}
extern "C" {
    pub fn mbrtowc(
        __pwc: *mut wchar_t,
        __s: *const ctypes::c_char,
        __n: size_t,
        __p: *mut mbstate_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcrtomb(__s: *mut ctypes::c_char, __wc: wchar_t, __ps: *mut mbstate_t) -> size_t;
}
extern "C" {
    pub fn __mbrlen(__s: *const ctypes::c_char, __n: size_t, __ps: *mut mbstate_t) -> size_t;
}
extern "C" {
    pub fn mbrlen(__s: *const ctypes::c_char, __n: size_t, __ps: *mut mbstate_t) -> size_t;
}
extern "C" {
    pub fn mbsrtowcs(
        __dst: *mut wchar_t,
        __src: *mut *const ctypes::c_char,
        __len: size_t,
        __ps: *mut mbstate_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcsrtombs(
        __dst: *mut ctypes::c_char,
        __src: *mut *const wchar_t,
        __len: size_t,
        __ps: *mut mbstate_t,
    ) -> size_t;
}
extern "C" {
    pub fn mbsnrtowcs(
        __dst: *mut wchar_t,
        __src: *mut *const ctypes::c_char,
        __nmc: size_t,
        __len: size_t,
        __ps: *mut mbstate_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcsnrtombs(
        __dst: *mut ctypes::c_char,
        __src: *mut *const wchar_t,
        __nwc: size_t,
        __len: size_t,
        __ps: *mut mbstate_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstod(__nptr: *const wchar_t, __endptr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstof(__nptr: *const wchar_t, __endptr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn wcstold(__nptr: *const wchar_t, __endptr: *mut *mut wchar_t) -> u128;
}
extern "C" {
    pub fn wcstol(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ctypes::c_int,
    ) -> ctypes::c_long;
}
extern "C" {
    pub fn wcstoul(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ctypes::c_int,
    ) -> ctypes::c_ulong;
}
extern "C" {
    pub fn wcstoll(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ctypes::c_int,
    ) -> ctypes::c_longlong;
}
extern "C" {
    pub fn wcstoull(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ctypes::c_int,
    ) -> ctypes::c_ulonglong;
}
extern "C" {
    pub fn wcpcpy(__dest: *mut wchar_t, __src: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcpncpy(__dest: *mut wchar_t, __src: *const wchar_t, __n: size_t) -> *mut wchar_t;
}
extern "C" {
    pub fn open_wmemstream(__bufloc: *mut *mut wchar_t, __sizeloc: *mut size_t) -> *mut __FILE;
}
extern "C" {
    pub fn fwide(__fp: *mut __FILE, __mode: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn fwprintf(__stream: *mut __FILE, __format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn wprintf(__format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn swprintf(__s: *mut wchar_t, __n: size_t, __format: *const wchar_t, ...)
        -> ctypes::c_int;
}
extern "C" {
    pub fn vfwprintf(
        __s: *mut __FILE,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn vwprintf(__format: *const wchar_t, __arg: *mut __va_list_tag) -> ctypes::c_int;
}
extern "C" {
    pub fn vswprintf(
        __s: *mut wchar_t,
        __n: size_t,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn fwscanf(__stream: *mut __FILE, __format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn wscanf(__format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn swscanf(__s: *const wchar_t, __format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fwscanf"]
    pub fn fwscanf1(__stream: *mut __FILE, __format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_wscanf"]
    pub fn wscanf1(__format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_swscanf"]
    pub fn swscanf1(__s: *const wchar_t, __format: *const wchar_t, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn vfwscanf(
        __s: *mut __FILE,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn vwscanf(__format: *const wchar_t, __arg: *mut __va_list_tag) -> ctypes::c_int;
}
extern "C" {
    pub fn vswscanf(
        __s: *const wchar_t,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfwscanf"]
    pub fn vfwscanf1(
        __s: *mut __FILE,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vwscanf"]
    pub fn vwscanf1(__format: *const wchar_t, __arg: *mut __va_list_tag) -> ctypes::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vswscanf"]
    pub fn vswscanf1(
        __s: *const wchar_t,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn fgetwc(__stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn getwc(__stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fputwc(__wc: wchar_t, __stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn putwc(__wc: wchar_t, __stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(__wc: wchar_t) -> wint_t;
}
extern "C" {
    pub fn fgetws(__ws: *mut wchar_t, __n: ctypes::c_int, __stream: *mut __FILE) -> *mut wchar_t;
}
extern "C" {
    pub fn fputws(__ws: *const wchar_t, __stream: *mut __FILE) -> ctypes::c_int;
}
extern "C" {
    pub fn ungetwc(__wc: wint_t, __stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn wcsftime(
        __s: *mut wchar_t,
        __maxsize: size_t,
        __format: *const wchar_t,
        __tp: *const tm,
    ) -> size_t;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ctypes::c_schar;
pub type int_fast16_t = ctypes::c_long;
pub type int_fast32_t = ctypes::c_long;
pub type int_fast64_t = ctypes::c_long;
pub type uint_fast8_t = ctypes::c_uchar;
pub type uint_fast16_t = ctypes::c_ulong;
pub type uint_fast32_t = ctypes::c_ulong;
pub type uint_fast64_t = ctypes::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ctypes::c_int;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ctypes::c_long,
    pub rem: ctypes::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::core::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ctypes::c_char,
        __endptr: *mut *mut ctypes::c_char,
        __base: ctypes::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ctypes::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ctypes::c_int,
    ) -> uintmax_t;
}
pub const _ISupper: ctypes::c_uint = 256;
pub const _ISlower: ctypes::c_uint = 512;
pub const _ISalpha: ctypes::c_uint = 1024;
pub const _ISdigit: ctypes::c_uint = 2048;
pub const _ISxdigit: ctypes::c_uint = 4096;
pub const _ISspace: ctypes::c_uint = 8192;
pub const _ISprint: ctypes::c_uint = 16384;
pub const _ISgraph: ctypes::c_uint = 32768;
pub const _ISblank: ctypes::c_uint = 1;
pub const _IScntrl: ctypes::c_uint = 2;
pub const _ISpunct: ctypes::c_uint = 4;
pub const _ISalnum: ctypes::c_uint = 8;
pub type _bindgen_ty_1 = ctypes::c_uint;
extern "C" {
    pub fn __ctype_b_loc() -> *mut *const ctypes::c_ushort;
}
extern "C" {
    pub fn __ctype_tolower_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn __ctype_toupper_loc() -> *mut *const __int32_t;
}
extern "C" {
    pub fn isalnum(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isalpha(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn iscntrl(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isdigit(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn islower(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isgraph(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isprint(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn ispunct(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isspace(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isupper(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isxdigit(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn tolower(__c: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn toupper(__c: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isblank(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isascii(__c: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn toascii(__c: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn _toupper(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn _tolower(arg1: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn isalnum_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isalpha_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn iscntrl_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isdigit_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn islower_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isgraph_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isprint_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn ispunct_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isspace_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isupper_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isxdigit_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn isblank_l(arg1: ctypes::c_int, arg2: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn __tolower_l(__c: ctypes::c_int, __l: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn tolower_l(__c: ctypes::c_int, __l: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn __toupper_l(__c: ctypes::c_int, __l: locale_t) -> ctypes::c_int;
}
extern "C" {
    pub fn toupper_l(__c: ctypes::c_int, __l: locale_t) -> ctypes::c_int;
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __fpclassify(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn __signbit(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn __isinf(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn __finite(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn __isnan(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn __issignaling(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn acos(__x: f64) -> f64;
}
extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
extern "C" {
    pub fn asin(__x: f64) -> f64;
}
extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
extern "C" {
    pub fn atan(__x: f64) -> f64;
}
extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cos(__x: f64) -> f64;
}
extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
extern "C" {
    pub fn sin(__x: f64) -> f64;
}
extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
extern "C" {
    pub fn tan(__x: f64) -> f64;
}
extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn exp(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ctypes::c_int) -> f64;
}
extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ctypes::c_int) -> f64;
}
extern "C" {
    pub fn ldexp(__x: f64, __exponent: ctypes::c_int) -> f64;
}
extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ctypes::c_int) -> f64;
}
extern "C" {
    pub fn log(__x: f64) -> f64;
}
extern "C" {
    pub fn __log(__x: f64) -> f64;
}
extern "C" {
    pub fn log10(__x: f64) -> f64;
}
extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn logb(__x: f64) -> f64;
}
extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn log2(__x: f64) -> f64;
}
extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn floor(__x: f64) -> f64;
}
extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn isinf(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn finite(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significand(__x: f64) -> f64;
}
extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nan(__tagb: *const ctypes::c_char) -> f64;
}
extern "C" {
    pub fn __nan(__tagb: *const ctypes::c_char) -> f64;
}
extern "C" {
    pub fn isnan(__value: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ctypes::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __jn(arg1: ctypes::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ctypes::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __yn(arg1: ctypes::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ctypes::c_int) -> f64;
}
extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ctypes::c_int) -> f64;
}
extern "C" {
    pub fn rint(__x: f64) -> f64;
}
extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn __nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbn(__x: f64, __n: ctypes::c_int) -> f64;
}
extern "C" {
    pub fn __scalbn(__x: f64, __n: ctypes::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(__x: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn __ilogb(__x: f64) -> ctypes::c_int;
}
extern "C" {
    pub fn scalbln(__x: f64, __n: ctypes::c_long) -> f64;
}
extern "C" {
    pub fn __scalbln(__x: f64, __n: ctypes::c_long) -> f64;
}
extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn round(__x: f64) -> f64;
}
extern "C" {
    pub fn __round(__x: f64) -> f64;
}
extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ctypes::c_int) -> f64;
}
extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ctypes::c_int) -> f64;
}
extern "C" {
    pub fn lrint(__x: f64) -> ctypes::c_long;
}
extern "C" {
    pub fn __lrint(__x: f64) -> ctypes::c_long;
}
extern "C" {
    pub fn llrint(__x: f64) -> ctypes::c_longlong;
}
extern "C" {
    pub fn __llrint(__x: f64) -> ctypes::c_longlong;
}
extern "C" {
    pub fn lround(__x: f64) -> ctypes::c_long;
}
extern "C" {
    pub fn __lround(__x: f64) -> ctypes::c_long;
}
extern "C" {
    pub fn llround(__x: f64) -> ctypes::c_longlong;
}
extern "C" {
    pub fn __llround(__x: f64) -> ctypes::c_longlong;
}
extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn __signbitf(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn __isinff(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn __finitef(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn __isnanf(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn __issignalingf(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn expf(__x: f32) -> f32;
}
extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ctypes::c_int) -> f32;
}
extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ctypes::c_int) -> f32;
}
extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ctypes::c_int) -> f32;
}
extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ctypes::c_int) -> f32;
}
extern "C" {
    pub fn logf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn isinff(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn finitef(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nanf(__tagb: *const ctypes::c_char) -> f32;
}
extern "C" {
    pub fn __nanf(__tagb: *const ctypes::c_char) -> f32;
}
extern "C" {
    pub fn isnanf(__value: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ctypes::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __jnf(arg1: ctypes::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ctypes::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __ynf(arg1: ctypes::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ctypes::c_int) -> f32;
}
extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ctypes::c_int) -> f32;
}
extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn __nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(__x: f32, __n: ctypes::c_int) -> f32;
}
extern "C" {
    pub fn __scalbnf(__x: f32, __n: ctypes::c_int) -> f32;
}
extern "C" {
    pub fn ilogbf(__x: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn __ilogbf(__x: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn scalblnf(__x: f32, __n: ctypes::c_long) -> f32;
}
extern "C" {
    pub fn __scalblnf(__x: f32, __n: ctypes::c_long) -> f32;
}
extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ctypes::c_int) -> f32;
}
extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ctypes::c_int) -> f32;
}
extern "C" {
    pub fn lrintf(__x: f32) -> ctypes::c_long;
}
extern "C" {
    pub fn __lrintf(__x: f32) -> ctypes::c_long;
}
extern "C" {
    pub fn llrintf(__x: f32) -> ctypes::c_longlong;
}
extern "C" {
    pub fn __llrintf(__x: f32) -> ctypes::c_longlong;
}
extern "C" {
    pub fn lroundf(__x: f32) -> ctypes::c_long;
}
extern "C" {
    pub fn __lroundf(__x: f32) -> ctypes::c_long;
}
extern "C" {
    pub fn llroundf(__x: f32) -> ctypes::c_longlong;
}
extern "C" {
    pub fn __llroundf(__x: f32) -> ctypes::c_longlong;
}
extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __fpclassifyl(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn __signbitl(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn __isinfl(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn __finitel(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn __isnanl(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn __iseqsigl(__x: u128, __y: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn __issignalingl(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn __atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn expl(__x: u128) -> u128;
}
extern "C" {
    pub fn __expl(__x: u128) -> u128;
}
extern "C" {
    pub fn frexpl(__x: u128, __exponent: *mut ctypes::c_int) -> u128;
}
extern "C" {
    pub fn __frexpl(__x: u128, __exponent: *mut ctypes::c_int) -> u128;
}
extern "C" {
    pub fn ldexpl(__x: u128, __exponent: ctypes::c_int) -> u128;
}
extern "C" {
    pub fn __ldexpl(__x: u128, __exponent: ctypes::c_int) -> u128;
}
extern "C" {
    pub fn logl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logl(__x: u128) -> u128;
}
extern "C" {
    pub fn log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn __modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn __expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn __log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn __ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn __fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn __floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn isinfl(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn finitel(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn __significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nanl(__tagb: *const ctypes::c_char) -> u128;
}
extern "C" {
    pub fn __nanl(__tagb: *const ctypes::c_char) -> u128;
}
extern "C" {
    pub fn isnanl(__value: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn jnl(arg1: ctypes::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __jnl(arg1: ctypes::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn ynl(arg1: ctypes::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __ynl(arg1: ctypes::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal_r(arg1: u128, __signgamp: *mut ctypes::c_int) -> u128;
}
extern "C" {
    pub fn __lgammal_r(arg1: u128, __signgamp: *mut ctypes::c_int) -> u128;
}
extern "C" {
    pub fn rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn scalbnl(__x: u128, __n: ctypes::c_int) -> u128;
}
extern "C" {
    pub fn __scalbnl(__x: u128, __n: ctypes::c_int) -> u128;
}
extern "C" {
    pub fn ilogbl(__x: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn __ilogbl(__x: u128) -> ctypes::c_int;
}
extern "C" {
    pub fn scalblnl(__x: u128, __n: ctypes::c_long) -> u128;
}
extern "C" {
    pub fn __scalblnl(__x: u128, __n: ctypes::c_long) -> u128;
}
extern "C" {
    pub fn nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn __roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn __truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn remquol(__x: u128, __y: u128, __quo: *mut ctypes::c_int) -> u128;
}
extern "C" {
    pub fn __remquol(__x: u128, __y: u128, __quo: *mut ctypes::c_int) -> u128;
}
extern "C" {
    pub fn lrintl(__x: u128) -> ctypes::c_long;
}
extern "C" {
    pub fn __lrintl(__x: u128) -> ctypes::c_long;
}
extern "C" {
    pub fn llrintl(__x: u128) -> ctypes::c_longlong;
}
extern "C" {
    pub fn __llrintl(__x: u128) -> ctypes::c_longlong;
}
extern "C" {
    pub fn lroundl(__x: u128) -> ctypes::c_long;
}
extern "C" {
    pub fn __lroundl(__x: u128) -> ctypes::c_long;
}
extern "C" {
    pub fn llroundl(__x: u128) -> ctypes::c_longlong;
}
extern "C" {
    pub fn __llroundl(__x: u128) -> ctypes::c_longlong;
}
extern "C" {
    pub fn fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn __fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub fn __scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub static mut signgam: ctypes::c_int;
}
pub const FP_NAN: ctypes::c_uint = 0;
pub const FP_INFINITE: ctypes::c_uint = 1;
pub const FP_ZERO: ctypes::c_uint = 2;
pub const FP_SUBNORMAL: ctypes::c_uint = 3;
pub const FP_NORMAL: ctypes::c_uint = 4;
pub type _bindgen_ty_2 = ctypes::c_uint;
pub const SDL_FALSE: SDL_bool = 0;
pub const SDL_TRUE: SDL_bool = 1;
pub type SDL_bool = ctypes::c_uint;
pub type Sint8 = i8;
pub type Uint8 = u8;
pub type Sint16 = i16;
pub type Uint16 = u16;
pub type Sint32 = i32;
pub type Uint32 = u32;
pub type Sint64 = i64;
pub type Uint64 = u64;
pub type SDL_compile_time_assert_uint8 = [ctypes::c_int; 1usize];
pub type SDL_compile_time_assert_sint8 = [ctypes::c_int; 1usize];
pub type SDL_compile_time_assert_uint16 = [ctypes::c_int; 1usize];
pub type SDL_compile_time_assert_sint16 = [ctypes::c_int; 1usize];
pub type SDL_compile_time_assert_uint32 = [ctypes::c_int; 1usize];
pub type SDL_compile_time_assert_sint32 = [ctypes::c_int; 1usize];
pub type SDL_compile_time_assert_uint64 = [ctypes::c_int; 1usize];
pub type SDL_compile_time_assert_sint64 = [ctypes::c_int; 1usize];
pub const DUMMY_ENUM_VALUE: SDL_DUMMY_ENUM = 0;
pub type SDL_DUMMY_ENUM = ctypes::c_uint;
pub type SDL_compile_time_assert_enum = [ctypes::c_int; 1usize];
extern "C" {
    pub fn SDL_malloc(size: size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_calloc(nmemb: size_t, size: size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_realloc(mem: *mut ctypes::c_void, size: size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_free(mem: *mut ctypes::c_void);
}
pub type SDL_malloc_func =
    ::core::option::Option<unsafe extern "C" fn(size: size_t) -> *mut ctypes::c_void>;
pub type SDL_calloc_func = ::core::option::Option<
    unsafe extern "C" fn(nmemb: size_t, size: size_t) -> *mut ctypes::c_void,
>;
pub type SDL_realloc_func = ::core::option::Option<
    unsafe extern "C" fn(mem: *mut ctypes::c_void, size: size_t) -> *mut ctypes::c_void,
>;
pub type SDL_free_func = ::core::option::Option<unsafe extern "C" fn(mem: *mut ctypes::c_void)>;
extern "C" {
    pub fn SDL_GetMemoryFunctions(
        malloc_func: *mut SDL_malloc_func,
        calloc_func: *mut SDL_calloc_func,
        realloc_func: *mut SDL_realloc_func,
        free_func: *mut SDL_free_func,
    );
}
extern "C" {
    pub fn SDL_SetMemoryFunctions(
        malloc_func: SDL_malloc_func,
        calloc_func: SDL_calloc_func,
        realloc_func: SDL_realloc_func,
        free_func: SDL_free_func,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetNumAllocations() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_getenv(name: *const ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_setenv(
        name: *const ctypes::c_char,
        value: *const ctypes::c_char,
        overwrite: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_qsort(
        base: *mut ctypes::c_void,
        nmemb: size_t,
        size: size_t,
        compare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const ctypes::c_void,
                arg2: *const ctypes::c_void,
            ) -> ctypes::c_int,
        >,
    );
}
extern "C" {
    pub fn SDL_abs(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isalpha(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isalnum(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isblank(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_iscntrl(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isdigit(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isxdigit(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_ispunct(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isspace(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isupper(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_islower(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isprint(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_isgraph(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_toupper(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_tolower(x: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_crc32(crc: Uint32, data: *const ctypes::c_void, len: size_t) -> Uint32;
}
extern "C" {
    pub fn SDL_memset(
        dst: *mut ctypes::c_void,
        c: ctypes::c_int,
        len: size_t,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_memcpy(
        dst: *mut ctypes::c_void,
        src: *const ctypes::c_void,
        len: size_t,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_memmove(
        dst: *mut ctypes::c_void,
        src: *const ctypes::c_void,
        len: size_t,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_memcmp(
        s1: *const ctypes::c_void,
        s2: *const ctypes::c_void,
        len: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_wcslen(wstr: *const wchar_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcpy(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcslcat(dst: *mut wchar_t, src: *const wchar_t, maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn SDL_wcsdup(wstr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcsstr(haystack: *const wchar_t, needle: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn SDL_wcscmp(str1: *const wchar_t, str2: *const wchar_t) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_wcsncmp(str1: *const wchar_t, str2: *const wchar_t, maxlen: size_t)
        -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_wcscasecmp(str1: *const wchar_t, str2: *const wchar_t) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_wcsncasecmp(
        str1: *const wchar_t,
        str2: *const wchar_t,
        len: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_strlen(str_: *const ctypes::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_strlcpy(
        dst: *mut ctypes::c_char,
        src: *const ctypes::c_char,
        maxlen: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_utf8strlcpy(
        dst: *mut ctypes::c_char,
        src: *const ctypes::c_char,
        dst_bytes: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strlcat(
        dst: *mut ctypes::c_char,
        src: *const ctypes::c_char,
        maxlen: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_strdup(str_: *const ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_strrev(str_: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_strupr(str_: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_strlwr(str_: *mut ctypes::c_char) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_strchr(str_: *const ctypes::c_char, c: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_strrchr(str_: *const ctypes::c_char, c: ctypes::c_int) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_strstr(
        haystack: *const ctypes::c_char,
        needle: *const ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_strtokr(
        s1: *mut ctypes::c_char,
        s2: *const ctypes::c_char,
        saveptr: *mut *mut ctypes::c_char,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_utf8strlen(str_: *const ctypes::c_char) -> size_t;
}
extern "C" {
    pub fn SDL_itoa(
        value: ctypes::c_int,
        str_: *mut ctypes::c_char,
        radix: ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_uitoa(
        value: ctypes::c_uint,
        str_: *mut ctypes::c_char,
        radix: ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_ltoa(
        value: ctypes::c_long,
        str_: *mut ctypes::c_char,
        radix: ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_ultoa(
        value: ctypes::c_ulong,
        str_: *mut ctypes::c_char,
        radix: ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_lltoa(
        value: Sint64,
        str_: *mut ctypes::c_char,
        radix: ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_ulltoa(
        value: Uint64,
        str_: *mut ctypes::c_char,
        radix: ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_atoi(str_: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_atof(str_: *const ctypes::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strtol(
        str_: *const ctypes::c_char,
        endp: *mut *mut ctypes::c_char,
        base: ctypes::c_int,
    ) -> ctypes::c_long;
}
extern "C" {
    pub fn SDL_strtoul(
        str_: *const ctypes::c_char,
        endp: *mut *mut ctypes::c_char,
        base: ctypes::c_int,
    ) -> ctypes::c_ulong;
}
extern "C" {
    pub fn SDL_strtoll(
        str_: *const ctypes::c_char,
        endp: *mut *mut ctypes::c_char,
        base: ctypes::c_int,
    ) -> Sint64;
}
extern "C" {
    pub fn SDL_strtoull(
        str_: *const ctypes::c_char,
        endp: *mut *mut ctypes::c_char,
        base: ctypes::c_int,
    ) -> Uint64;
}
extern "C" {
    pub fn SDL_strtod(str_: *const ctypes::c_char, endp: *mut *mut ctypes::c_char) -> f64;
}
extern "C" {
    pub fn SDL_strcmp(str1: *const ctypes::c_char, str2: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_strncmp(
        str1: *const ctypes::c_char,
        str2: *const ctypes::c_char,
        maxlen: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_strcasecmp(
        str1: *const ctypes::c_char,
        str2: *const ctypes::c_char,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_strncasecmp(
        str1: *const ctypes::c_char,
        str2: *const ctypes::c_char,
        len: size_t,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_sscanf(
        text: *const ctypes::c_char,
        fmt: *const ctypes::c_char,
        ...
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_vsscanf(
        text: *const ctypes::c_char,
        fmt: *const ctypes::c_char,
        ap: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_snprintf(
        text: *mut ctypes::c_char,
        maxlen: size_t,
        fmt: *const ctypes::c_char,
        ...
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_vsnprintf(
        text: *mut ctypes::c_char,
        maxlen: size_t,
        fmt: *const ctypes::c_char,
        ap: *mut __va_list_tag,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_acos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_acosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_asin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_asinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_atanf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_atan2(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_atan2f(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_ceil(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_ceilf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_copysign(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_copysignf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_cos(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_cosf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_exp(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_expf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fabs(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_fabsf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_floor(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_floorf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_trunc(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_truncf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_fmod(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_fmodf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_log(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_logf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_log10(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_log10f(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_pow(x: f64, y: f64) -> f64;
}
extern "C" {
    pub fn SDL_powf(x: f32, y: f32) -> f32;
}
extern "C" {
    pub fn SDL_round(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_roundf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_lround(x: f64) -> ctypes::c_long;
}
extern "C" {
    pub fn SDL_lroundf(x: f32) -> ctypes::c_long;
}
extern "C" {
    pub fn SDL_scalbn(x: f64, n: ctypes::c_int) -> f64;
}
extern "C" {
    pub fn SDL_scalbnf(x: f32, n: ctypes::c_int) -> f32;
}
extern "C" {
    pub fn SDL_sin(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sinf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_sqrt(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_sqrtf(x: f32) -> f32;
}
extern "C" {
    pub fn SDL_tan(x: f64) -> f64;
}
extern "C" {
    pub fn SDL_tanf(x: f32) -> f32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_iconv_t {
    _unused: [u8; 0],
}
pub type SDL_iconv_t = *mut _SDL_iconv_t;
extern "C" {
    pub fn SDL_iconv_open(
        tocode: *const ctypes::c_char,
        fromcode: *const ctypes::c_char,
    ) -> SDL_iconv_t;
}
extern "C" {
    pub fn SDL_iconv_close(cd: SDL_iconv_t) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_iconv(
        cd: SDL_iconv_t,
        inbuf: *mut *const ctypes::c_char,
        inbytesleft: *mut size_t,
        outbuf: *mut *mut ctypes::c_char,
        outbytesleft: *mut size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_iconv_string(
        tocode: *const ctypes::c_char,
        fromcode: *const ctypes::c_char,
        inbuf: *const ctypes::c_char,
        inbytesleft: size_t,
    ) -> *mut ctypes::c_char;
}
pub type SDL_main_func = ::core::option::Option<
    unsafe extern "C" fn(argc: ctypes::c_int, argv: *mut *mut ctypes::c_char) -> ctypes::c_int,
>;
extern "C" {
    pub fn SDL_main(argc: ctypes::c_int, argv: *mut *mut ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetMainReady();
}
pub const SDL_ASSERTION_RETRY: SDL_AssertState = 0;
pub const SDL_ASSERTION_BREAK: SDL_AssertState = 1;
pub const SDL_ASSERTION_ABORT: SDL_AssertState = 2;
pub const SDL_ASSERTION_IGNORE: SDL_AssertState = 3;
pub const SDL_ASSERTION_ALWAYS_IGNORE: SDL_AssertState = 4;
pub type SDL_AssertState = ctypes::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AssertData {
    pub always_ignore: ctypes::c_int,
    pub trigger_count: ctypes::c_uint,
    pub condition: *const ctypes::c_char,
    pub filename: *const ctypes::c_char,
    pub linenum: ctypes::c_int,
    pub function: *const ctypes::c_char,
    pub next: *const SDL_AssertData,
}
#[test]
fn bindgen_test_layout_SDL_AssertData() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AssertData>(),
        48usize,
        concat!("Size of: ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AssertData>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AssertData))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).always_ignore as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(always_ignore)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).trigger_count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(trigger_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).condition as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(condition)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).filename as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(filename)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).linenum as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(linenum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).function as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AssertData>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AssertData),
            "::",
            stringify!(next)
        )
    );
}
impl Default for SDL_AssertData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SDL_ReportAssertion(
        arg1: *mut SDL_AssertData,
        arg2: *const ctypes::c_char,
        arg3: *const ctypes::c_char,
        arg4: ctypes::c_int,
    ) -> SDL_AssertState;
}
pub type SDL_AssertionHandler = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const SDL_AssertData,
        userdata: *mut ctypes::c_void,
    ) -> SDL_AssertState,
>;
extern "C" {
    pub fn SDL_SetAssertionHandler(handler: SDL_AssertionHandler, userdata: *mut ctypes::c_void);
}
extern "C" {
    pub fn SDL_GetDefaultAssertionHandler() -> SDL_AssertionHandler;
}
extern "C" {
    pub fn SDL_GetAssertionHandler(puserdata: *mut *mut ctypes::c_void) -> SDL_AssertionHandler;
}
extern "C" {
    pub fn SDL_GetAssertionReport() -> *const SDL_AssertData;
}
extern "C" {
    pub fn SDL_ResetAssertionReport();
}
pub type SDL_SpinLock = ctypes::c_int;
extern "C" {
    pub fn SDL_AtomicTryLock(lock: *mut SDL_SpinLock) -> SDL_bool;
}
extern "C" {
    pub fn SDL_AtomicLock(lock: *mut SDL_SpinLock);
}
extern "C" {
    pub fn SDL_AtomicUnlock(lock: *mut SDL_SpinLock);
}
extern "C" {
    pub fn SDL_MemoryBarrierReleaseFunction();
}
extern "C" {
    pub fn SDL_MemoryBarrierAcquireFunction();
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct SDL_atomic_t {
    pub value: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_SDL_atomic_t() {
    assert_eq!(
        ::core::mem::size_of::<SDL_atomic_t>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_atomic_t>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_atomic_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_atomic_t>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_atomic_t),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    pub fn SDL_AtomicCAS(
        a: *mut SDL_atomic_t,
        oldval: ctypes::c_int,
        newval: ctypes::c_int,
    ) -> SDL_bool;
}
extern "C" {
    pub fn SDL_AtomicSet(a: *mut SDL_atomic_t, v: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AtomicGet(a: *mut SDL_atomic_t) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AtomicAdd(a: *mut SDL_atomic_t, v: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AtomicCASPtr(
        a: *mut *mut ctypes::c_void,
        oldval: *mut ctypes::c_void,
        newval: *mut ctypes::c_void,
    ) -> SDL_bool;
}
extern "C" {
    pub fn SDL_AtomicSetPtr(
        a: *mut *mut ctypes::c_void,
        v: *mut ctypes::c_void,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_AtomicGetPtr(a: *mut *mut ctypes::c_void) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_SetError(fmt: *const ctypes::c_char, ...) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetError() -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_GetErrorMsg(
        errstr: *mut ctypes::c_char,
        maxlen: ctypes::c_int,
    ) -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_ClearError();
}
pub const SDL_ENOMEM: SDL_errorcode = 0;
pub const SDL_EFREAD: SDL_errorcode = 1;
pub const SDL_EFWRITE: SDL_errorcode = 2;
pub const SDL_EFSEEK: SDL_errorcode = 3;
pub const SDL_UNSUPPORTED: SDL_errorcode = 4;
pub const SDL_LASTERROR: SDL_errorcode = 5;
pub type SDL_errorcode = ctypes::c_uint;
extern "C" {
    pub fn SDL_Error(code: SDL_errorcode) -> ctypes::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_mutex {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SDL_CreateMutex() -> *mut SDL_mutex;
}
extern "C" {
    pub fn SDL_LockMutex(mutex: *mut SDL_mutex) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_TryLockMutex(mutex: *mut SDL_mutex) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_UnlockMutex(mutex: *mut SDL_mutex) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_DestroyMutex(mutex: *mut SDL_mutex);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_semaphore {
    _unused: [u8; 0],
}
pub type SDL_sem = SDL_semaphore;
extern "C" {
    pub fn SDL_CreateSemaphore(initial_value: Uint32) -> *mut SDL_sem;
}
extern "C" {
    pub fn SDL_DestroySemaphore(sem: *mut SDL_sem);
}
extern "C" {
    pub fn SDL_SemWait(sem: *mut SDL_sem) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SemTryWait(sem: *mut SDL_sem) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SemWaitTimeout(sem: *mut SDL_sem, ms: Uint32) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SemPost(sem: *mut SDL_sem) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SemValue(sem: *mut SDL_sem) -> Uint32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_cond {
    _unused: [u8; 0],
}
extern "C" {
    pub fn SDL_CreateCond() -> *mut SDL_cond;
}
extern "C" {
    pub fn SDL_DestroyCond(cond: *mut SDL_cond);
}
extern "C" {
    pub fn SDL_CondSignal(cond: *mut SDL_cond) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_CondBroadcast(cond: *mut SDL_cond) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_CondWait(cond: *mut SDL_cond, mutex: *mut SDL_mutex) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_CondWaitTimeout(
        cond: *mut SDL_cond,
        mutex: *mut SDL_mutex,
        ms: Uint32,
    ) -> ctypes::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Thread {
    _unused: [u8; 0],
}
pub type SDL_threadID = ctypes::c_ulong;
pub type SDL_TLSID = ctypes::c_uint;
pub const SDL_THREAD_PRIORITY_LOW: SDL_ThreadPriority = 0;
pub const SDL_THREAD_PRIORITY_NORMAL: SDL_ThreadPriority = 1;
pub const SDL_THREAD_PRIORITY_HIGH: SDL_ThreadPriority = 2;
pub const SDL_THREAD_PRIORITY_TIME_CRITICAL: SDL_ThreadPriority = 3;
pub type SDL_ThreadPriority = ctypes::c_uint;
pub type SDL_ThreadFunction =
    ::core::option::Option<unsafe extern "C" fn(data: *mut ctypes::c_void) -> ctypes::c_int>;
extern "C" {
    pub fn SDL_CreateThread(
        fn_: SDL_ThreadFunction,
        name: *const ctypes::c_char,
        data: *mut ctypes::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    pub fn SDL_CreateThreadWithStackSize(
        fn_: SDL_ThreadFunction,
        name: *const ctypes::c_char,
        stacksize: size_t,
        data: *mut ctypes::c_void,
    ) -> *mut SDL_Thread;
}
extern "C" {
    pub fn SDL_GetThreadName(thread: *mut SDL_Thread) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_ThreadID() -> SDL_threadID;
}
extern "C" {
    pub fn SDL_GetThreadID(thread: *mut SDL_Thread) -> SDL_threadID;
}
extern "C" {
    pub fn SDL_SetThreadPriority(priority: SDL_ThreadPriority) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_WaitThread(thread: *mut SDL_Thread, status: *mut ctypes::c_int);
}
extern "C" {
    pub fn SDL_DetachThread(thread: *mut SDL_Thread);
}
extern "C" {
    pub fn SDL_TLSCreate() -> SDL_TLSID;
}
extern "C" {
    pub fn SDL_TLSGet(id: SDL_TLSID) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_TLSSet(
        id: SDL_TLSID,
        value: *const ctypes::c_void,
        destructor: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ctypes::c_void)>,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_TLSCleanup();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops {
    pub size: ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> Sint64>,
    pub seek: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            offset: Sint64,
            whence: ctypes::c_int,
        ) -> Sint64,
    >,
    pub read: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *mut ctypes::c_void,
            size: size_t,
            maxnum: size_t,
        ) -> size_t,
    >,
    pub write: ::core::option::Option<
        unsafe extern "C" fn(
            context: *mut SDL_RWops,
            ptr: *const ctypes::c_void,
            size: size_t,
            num: size_t,
        ) -> size_t,
    >,
    pub close:
        ::core::option::Option<unsafe extern "C" fn(context: *mut SDL_RWops) -> ctypes::c_int>,
    pub type_: Uint32,
    pub hidden: SDL_RWops__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union SDL_RWops__bindgen_ty_1 {
    pub stdio: SDL_RWops__bindgen_ty_1__bindgen_ty_1,
    pub mem: SDL_RWops__bindgen_ty_1__bindgen_ty_2,
    pub unknown: SDL_RWops__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    pub autoclose: SDL_bool,
    pub fp: *mut FILE,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).autoclose as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(autoclose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_1>())).fp as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(fp)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    pub base: *mut Uint8,
    pub here: *mut Uint8,
    pub stop: *mut Uint8,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).base as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).here as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(here)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_2>())).stop as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(stop)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_3 {
    pub data1: *mut ctypes::c_void,
    pub data2: *mut ctypes::c_void,
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>())).data1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1__bindgen_ty_3>())).data2 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(data2)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_SDL_RWops__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1>())).stdio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(stdio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1>())).mem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SDL_RWops__bindgen_ty_1>())).unknown as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops__bindgen_ty_1),
            "::",
            stringify!(unknown)
        )
    );
}
impl Default for SDL_RWops__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_SDL_RWops() {
    assert_eq!(
        ::core::mem::size_of::<SDL_RWops>(),
        72usize,
        concat!("Size of: ", stringify!(SDL_RWops))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_RWops>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_RWops))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).seek as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).write as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).close as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).type_ as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_RWops>())).hidden as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_RWops),
            "::",
            stringify!(hidden)
        )
    );
}
impl Default for SDL_RWops {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SDL_RWFromFile(
        file: *const ctypes::c_char,
        mode: *const ctypes::c_char,
    ) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromFP(fp: *mut FILE, autoclose: SDL_bool) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromMem(mem: *mut ctypes::c_void, size: ctypes::c_int) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_RWFromConstMem(mem: *const ctypes::c_void, size: ctypes::c_int) -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_AllocRW() -> *mut SDL_RWops;
}
extern "C" {
    pub fn SDL_FreeRW(area: *mut SDL_RWops);
}
extern "C" {
    pub fn SDL_RWsize(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    pub fn SDL_RWseek(context: *mut SDL_RWops, offset: Sint64, whence: ctypes::c_int) -> Sint64;
}
extern "C" {
    pub fn SDL_RWtell(context: *mut SDL_RWops) -> Sint64;
}
extern "C" {
    pub fn SDL_RWread(
        context: *mut SDL_RWops,
        ptr: *mut ctypes::c_void,
        size: size_t,
        maxnum: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_RWwrite(
        context: *mut SDL_RWops,
        ptr: *const ctypes::c_void,
        size: size_t,
        num: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn SDL_RWclose(context: *mut SDL_RWops) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_LoadFile_RW(
        src: *mut SDL_RWops,
        datasize: *mut size_t,
        freesrc: ctypes::c_int,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_LoadFile(file: *const ctypes::c_char, datasize: *mut size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_ReadU8(src: *mut SDL_RWops) -> Uint8;
}
extern "C" {
    pub fn SDL_ReadLE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadBE16(src: *mut SDL_RWops) -> Uint16;
}
extern "C" {
    pub fn SDL_ReadLE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadBE32(src: *mut SDL_RWops) -> Uint32;
}
extern "C" {
    pub fn SDL_ReadLE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_ReadBE64(src: *mut SDL_RWops) -> Uint64;
}
extern "C" {
    pub fn SDL_WriteU8(dst: *mut SDL_RWops, value: Uint8) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE16(dst: *mut SDL_RWops, value: Uint16) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE32(dst: *mut SDL_RWops, value: Uint32) -> size_t;
}
extern "C" {
    pub fn SDL_WriteLE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
extern "C" {
    pub fn SDL_WriteBE64(dst: *mut SDL_RWops, value: Uint64) -> size_t;
}
pub type SDL_AudioFormat = Uint16;
pub type SDL_AudioCallback = ::core::option::Option<
    unsafe extern "C" fn(userdata: *mut ctypes::c_void, stream: *mut Uint8, len: ctypes::c_int),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_AudioSpec {
    pub freq: ctypes::c_int,
    pub format: SDL_AudioFormat,
    pub channels: Uint8,
    pub silence: Uint8,
    pub samples: Uint16,
    pub padding: Uint16,
    pub size: Uint32,
    pub callback: SDL_AudioCallback,
    pub userdata: *mut ctypes::c_void,
}
#[test]
fn bindgen_test_layout_SDL_AudioSpec() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioSpec>(),
        32usize,
        concat!("Size of: ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioSpec>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_AudioSpec))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).freq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).channels as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).silence as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(silence)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).samples as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(samples)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).padding as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).callback as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioSpec>())).userdata as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioSpec),
            "::",
            stringify!(userdata)
        )
    );
}
impl Default for SDL_AudioSpec {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SDL_AudioFilter =
    ::core::option::Option<unsafe extern "C" fn(cvt: *mut SDL_AudioCVT, format: SDL_AudioFormat)>;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct SDL_AudioCVT {
    pub needed: ctypes::c_int,
    pub src_format: SDL_AudioFormat,
    pub dst_format: SDL_AudioFormat,
    pub rate_incr: f64,
    pub buf: *mut Uint8,
    pub len: ctypes::c_int,
    pub len_cvt: ctypes::c_int,
    pub len_mult: ctypes::c_int,
    pub len_ratio: f64,
    pub filters: [SDL_AudioFilter; 10usize],
    pub filter_index: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_SDL_AudioCVT() {
    assert_eq!(
        ::core::mem::size_of::<SDL_AudioCVT>(),
        128usize,
        concat!("Size of: ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_AudioCVT>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_AudioCVT))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).needed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(needed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).src_format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(src_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).dst_format as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(dst_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).rate_incr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(rate_incr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).buf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_cvt as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_cvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_mult as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).len_ratio as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(len_ratio)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).filters as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_AudioCVT>())).filter_index as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_AudioCVT),
            "::",
            stringify!(filter_index)
        )
    );
}
impl Default for SDL_AudioCVT {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SDL_GetNumAudioDrivers() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetAudioDriver(index: ctypes::c_int) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_AudioInit(driver_name: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AudioQuit();
}
extern "C" {
    pub fn SDL_GetCurrentAudioDriver() -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_OpenAudio(
        desired: *mut SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
    ) -> ctypes::c_int;
}
pub type SDL_AudioDeviceID = Uint32;
extern "C" {
    pub fn SDL_GetNumAudioDevices(iscapture: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetAudioDeviceName(
        index: ctypes::c_int,
        iscapture: ctypes::c_int,
    ) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_GetAudioDeviceSpec(
        index: ctypes::c_int,
        iscapture: ctypes::c_int,
        spec: *mut SDL_AudioSpec,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_OpenAudioDevice(
        device: *const ctypes::c_char,
        iscapture: ctypes::c_int,
        desired: *const SDL_AudioSpec,
        obtained: *mut SDL_AudioSpec,
        allowed_changes: ctypes::c_int,
    ) -> SDL_AudioDeviceID;
}
pub const SDL_AUDIO_STOPPED: SDL_AudioStatus = 0;
pub const SDL_AUDIO_PLAYING: SDL_AudioStatus = 1;
pub const SDL_AUDIO_PAUSED: SDL_AudioStatus = 2;
pub type SDL_AudioStatus = ctypes::c_uint;
extern "C" {
    pub fn SDL_GetAudioStatus() -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_GetAudioDeviceStatus(dev: SDL_AudioDeviceID) -> SDL_AudioStatus;
}
extern "C" {
    pub fn SDL_PauseAudio(pause_on: ctypes::c_int);
}
extern "C" {
    pub fn SDL_PauseAudioDevice(dev: SDL_AudioDeviceID, pause_on: ctypes::c_int);
}
extern "C" {
    pub fn SDL_LoadWAV_RW(
        src: *mut SDL_RWops,
        freesrc: ctypes::c_int,
        spec: *mut SDL_AudioSpec,
        audio_buf: *mut *mut Uint8,
        audio_len: *mut Uint32,
    ) -> *mut SDL_AudioSpec;
}
extern "C" {
    pub fn SDL_FreeWAV(audio_buf: *mut Uint8);
}
extern "C" {
    pub fn SDL_BuildAudioCVT(
        cvt: *mut SDL_AudioCVT,
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: ctypes::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_ConvertAudio(cvt: *mut SDL_AudioCVT) -> ctypes::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_AudioStream {
    _unused: [u8; 0],
}
pub type SDL_AudioStream = _SDL_AudioStream;
extern "C" {
    pub fn SDL_NewAudioStream(
        src_format: SDL_AudioFormat,
        src_channels: Uint8,
        src_rate: ctypes::c_int,
        dst_format: SDL_AudioFormat,
        dst_channels: Uint8,
        dst_rate: ctypes::c_int,
    ) -> *mut SDL_AudioStream;
}
extern "C" {
    pub fn SDL_AudioStreamPut(
        stream: *mut SDL_AudioStream,
        buf: *const ctypes::c_void,
        len: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AudioStreamGet(
        stream: *mut SDL_AudioStream,
        buf: *mut ctypes::c_void,
        len: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AudioStreamAvailable(stream: *mut SDL_AudioStream) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AudioStreamFlush(stream: *mut SDL_AudioStream) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_AudioStreamClear(stream: *mut SDL_AudioStream);
}
extern "C" {
    pub fn SDL_FreeAudioStream(stream: *mut SDL_AudioStream);
}
extern "C" {
    pub fn SDL_MixAudio(dst: *mut Uint8, src: *const Uint8, len: Uint32, volume: ctypes::c_int);
}
extern "C" {
    pub fn SDL_MixAudioFormat(
        dst: *mut Uint8,
        src: *const Uint8,
        format: SDL_AudioFormat,
        len: Uint32,
        volume: ctypes::c_int,
    );
}
extern "C" {
    pub fn SDL_QueueAudio(
        dev: SDL_AudioDeviceID,
        data: *const ctypes::c_void,
        len: Uint32,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_DequeueAudio(
        dev: SDL_AudioDeviceID,
        data: *mut ctypes::c_void,
        len: Uint32,
    ) -> Uint32;
}
extern "C" {
    pub fn SDL_GetQueuedAudioSize(dev: SDL_AudioDeviceID) -> Uint32;
}
extern "C" {
    pub fn SDL_ClearQueuedAudio(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_LockAudio();
}
extern "C" {
    pub fn SDL_LockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_UnlockAudio();
}
extern "C" {
    pub fn SDL_UnlockAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_CloseAudio();
}
extern "C" {
    pub fn SDL_CloseAudioDevice(dev: SDL_AudioDeviceID);
}
extern "C" {
    pub fn SDL_SetClipboardText(text: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetClipboardText() -> *mut ctypes::c_char;
}
extern "C" {
    pub fn SDL_HasClipboardText() -> SDL_bool;
}
pub type __m64 = [ctypes::c_longlong; 1usize];
pub type __v1di = [ctypes::c_longlong; 1usize];
pub type __v2si = [ctypes::c_int; 2usize];
pub type __v4hi = [ctypes::c_short; 4usize];
pub type __v8qi = [ctypes::c_char; 8usize];
pub type __v4si = [ctypes::c_int; 4usize];
pub type __v4sf = [f32; 4usize];
pub type __m128 = [f32; 4usize];
pub type __m128_u = [f32; 4usize];
pub type __v4su = [ctypes::c_uint; 4usize];
extern "C" {
    pub fn _mm_sfence();
}
extern "C" {
    pub fn _mm_getcsr() -> ctypes::c_uint;
}
extern "C" {
    pub fn _mm_setcsr(__i: ctypes::c_uint);
}
pub type __m128d = [f64; 2usize];
pub type __m128i = [ctypes::c_longlong; 2usize];
pub type __m128d_u = [f64; 2usize];
pub type __m128i_u = [ctypes::c_longlong; 2usize];
pub type __v2df = [f64; 2usize];
pub type __v2di = [ctypes::c_longlong; 2usize];
pub type __v8hi = [ctypes::c_short; 8usize];
pub type __v16qi = [ctypes::c_char; 16usize];
pub type __v2du = [ctypes::c_ulonglong; 2usize];
pub type __v8hu = [ctypes::c_ushort; 8usize];
pub type __v16qu = [ctypes::c_uchar; 16usize];
pub type __v16qs = [ctypes::c_schar; 16usize];
extern "C" {
    pub fn _mm_clflush(__p: *const ctypes::c_void);
}
extern "C" {
    pub fn _mm_lfence();
}
extern "C" {
    pub fn _mm_mfence();
}
extern "C" {
    pub fn _mm_pause();
}
pub type __v4df = [f64; 4usize];
pub type __v8sf = [f32; 8usize];
pub type __v4di = [ctypes::c_longlong; 4usize];
pub type __v8si = [ctypes::c_int; 8usize];
pub type __v16hi = [ctypes::c_short; 16usize];
pub type __v32qi = [ctypes::c_char; 32usize];
pub type __v4du = [ctypes::c_ulonglong; 4usize];
pub type __v8su = [ctypes::c_uint; 8usize];
pub type __v16hu = [ctypes::c_ushort; 16usize];
pub type __v32qu = [ctypes::c_uchar; 32usize];
pub type __v32qs = [ctypes::c_schar; 32usize];
pub type __m256 = [f32; 8usize];
pub type __m256d = [f64; 4usize];
pub type __m256i = [ctypes::c_longlong; 4usize];
pub type __m256_u = [f32; 8usize];
pub type __m256d_u = [f64; 4usize];
pub type __m256i_u = [ctypes::c_longlong; 4usize];
pub type __v64qi = [ctypes::c_char; 64usize];
pub type __v32hi = [ctypes::c_short; 32usize];
pub type __v8df = [f64; 8usize];
pub type __v16sf = [f32; 16usize];
pub type __v8di = [ctypes::c_longlong; 8usize];
pub type __v16si = [ctypes::c_int; 16usize];
pub type __v64qu = [ctypes::c_uchar; 64usize];
pub type __v32hu = [ctypes::c_ushort; 32usize];
pub type __v8du = [ctypes::c_ulonglong; 8usize];
pub type __v16su = [ctypes::c_uint; 16usize];
pub type __m512 = [f32; 16usize];
pub type __m512d = [f64; 8usize];
pub type __m512i = [ctypes::c_longlong; 8usize];
pub type __m512_u = [f32; 16usize];
pub type __m512d_u = [f64; 8usize];
pub type __m512i_u = [ctypes::c_longlong; 8usize];
pub type __mmask8 = ctypes::c_uchar;
pub type __mmask16 = ctypes::c_ushort;
pub const _MM_CMPINT_EQ: _MM_CMPINT_ENUM = 0;
pub const _MM_CMPINT_LT: _MM_CMPINT_ENUM = 1;
pub const _MM_CMPINT_LE: _MM_CMPINT_ENUM = 2;
pub const _MM_CMPINT_UNUSED: _MM_CMPINT_ENUM = 3;
pub const _MM_CMPINT_NE: _MM_CMPINT_ENUM = 4;
pub const _MM_CMPINT_NLT: _MM_CMPINT_ENUM = 5;
pub const _MM_CMPINT_NLE: _MM_CMPINT_ENUM = 6;
pub type _MM_CMPINT_ENUM = ctypes::c_uint;
pub const _MM_PERM_AAAA: _MM_PERM_ENUM = 0;
pub const _MM_PERM_AAAB: _MM_PERM_ENUM = 1;
pub const _MM_PERM_AAAC: _MM_PERM_ENUM = 2;
pub const _MM_PERM_AAAD: _MM_PERM_ENUM = 3;
pub const _MM_PERM_AABA: _MM_PERM_ENUM = 4;
pub const _MM_PERM_AABB: _MM_PERM_ENUM = 5;
pub const _MM_PERM_AABC: _MM_PERM_ENUM = 6;
pub const _MM_PERM_AABD: _MM_PERM_ENUM = 7;
pub const _MM_PERM_AACA: _MM_PERM_ENUM = 8;
pub const _MM_PERM_AACB: _MM_PERM_ENUM = 9;
pub const _MM_PERM_AACC: _MM_PERM_ENUM = 10;
pub const _MM_PERM_AACD: _MM_PERM_ENUM = 11;
pub const _MM_PERM_AADA: _MM_PERM_ENUM = 12;
pub const _MM_PERM_AADB: _MM_PERM_ENUM = 13;
pub const _MM_PERM_AADC: _MM_PERM_ENUM = 14;
pub const _MM_PERM_AADD: _MM_PERM_ENUM = 15;
pub const _MM_PERM_ABAA: _MM_PERM_ENUM = 16;
pub const _MM_PERM_ABAB: _MM_PERM_ENUM = 17;
pub const _MM_PERM_ABAC: _MM_PERM_ENUM = 18;
pub const _MM_PERM_ABAD: _MM_PERM_ENUM = 19;
pub const _MM_PERM_ABBA: _MM_PERM_ENUM = 20;
pub const _MM_PERM_ABBB: _MM_PERM_ENUM = 21;
pub const _MM_PERM_ABBC: _MM_PERM_ENUM = 22;
pub const _MM_PERM_ABBD: _MM_PERM_ENUM = 23;
pub const _MM_PERM_ABCA: _MM_PERM_ENUM = 24;
pub const _MM_PERM_ABCB: _MM_PERM_ENUM = 25;
pub const _MM_PERM_ABCC: _MM_PERM_ENUM = 26;
pub const _MM_PERM_ABCD: _MM_PERM_ENUM = 27;
pub const _MM_PERM_ABDA: _MM_PERM_ENUM = 28;
pub const _MM_PERM_ABDB: _MM_PERM_ENUM = 29;
pub const _MM_PERM_ABDC: _MM_PERM_ENUM = 30;
pub const _MM_PERM_ABDD: _MM_PERM_ENUM = 31;
pub const _MM_PERM_ACAA: _MM_PERM_ENUM = 32;
pub const _MM_PERM_ACAB: _MM_PERM_ENUM = 33;
pub const _MM_PERM_ACAC: _MM_PERM_ENUM = 34;
pub const _MM_PERM_ACAD: _MM_PERM_ENUM = 35;
pub const _MM_PERM_ACBA: _MM_PERM_ENUM = 36;
pub const _MM_PERM_ACBB: _MM_PERM_ENUM = 37;
pub const _MM_PERM_ACBC: _MM_PERM_ENUM = 38;
pub const _MM_PERM_ACBD: _MM_PERM_ENUM = 39;
pub const _MM_PERM_ACCA: _MM_PERM_ENUM = 40;
pub const _MM_PERM_ACCB: _MM_PERM_ENUM = 41;
pub const _MM_PERM_ACCC: _MM_PERM_ENUM = 42;
pub const _MM_PERM_ACCD: _MM_PERM_ENUM = 43;
pub const _MM_PERM_ACDA: _MM_PERM_ENUM = 44;
pub const _MM_PERM_ACDB: _MM_PERM_ENUM = 45;
pub const _MM_PERM_ACDC: _MM_PERM_ENUM = 46;
pub const _MM_PERM_ACDD: _MM_PERM_ENUM = 47;
pub const _MM_PERM_ADAA: _MM_PERM_ENUM = 48;
pub const _MM_PERM_ADAB: _MM_PERM_ENUM = 49;
pub const _MM_PERM_ADAC: _MM_PERM_ENUM = 50;
pub const _MM_PERM_ADAD: _MM_PERM_ENUM = 51;
pub const _MM_PERM_ADBA: _MM_PERM_ENUM = 52;
pub const _MM_PERM_ADBB: _MM_PERM_ENUM = 53;
pub const _MM_PERM_ADBC: _MM_PERM_ENUM = 54;
pub const _MM_PERM_ADBD: _MM_PERM_ENUM = 55;
pub const _MM_PERM_ADCA: _MM_PERM_ENUM = 56;
pub const _MM_PERM_ADCB: _MM_PERM_ENUM = 57;
pub const _MM_PERM_ADCC: _MM_PERM_ENUM = 58;
pub const _MM_PERM_ADCD: _MM_PERM_ENUM = 59;
pub const _MM_PERM_ADDA: _MM_PERM_ENUM = 60;
pub const _MM_PERM_ADDB: _MM_PERM_ENUM = 61;
pub const _MM_PERM_ADDC: _MM_PERM_ENUM = 62;
pub const _MM_PERM_ADDD: _MM_PERM_ENUM = 63;
pub const _MM_PERM_BAAA: _MM_PERM_ENUM = 64;
pub const _MM_PERM_BAAB: _MM_PERM_ENUM = 65;
pub const _MM_PERM_BAAC: _MM_PERM_ENUM = 66;
pub const _MM_PERM_BAAD: _MM_PERM_ENUM = 67;
pub const _MM_PERM_BABA: _MM_PERM_ENUM = 68;
pub const _MM_PERM_BABB: _MM_PERM_ENUM = 69;
pub const _MM_PERM_BABC: _MM_PERM_ENUM = 70;
pub const _MM_PERM_BABD: _MM_PERM_ENUM = 71;
pub const _MM_PERM_BACA: _MM_PERM_ENUM = 72;
pub const _MM_PERM_BACB: _MM_PERM_ENUM = 73;
pub const _MM_PERM_BACC: _MM_PERM_ENUM = 74;
pub const _MM_PERM_BACD: _MM_PERM_ENUM = 75;
pub const _MM_PERM_BADA: _MM_PERM_ENUM = 76;
pub const _MM_PERM_BADB: _MM_PERM_ENUM = 77;
pub const _MM_PERM_BADC: _MM_PERM_ENUM = 78;
pub const _MM_PERM_BADD: _MM_PERM_ENUM = 79;
pub const _MM_PERM_BBAA: _MM_PERM_ENUM = 80;
pub const _MM_PERM_BBAB: _MM_PERM_ENUM = 81;
pub const _MM_PERM_BBAC: _MM_PERM_ENUM = 82;
pub const _MM_PERM_BBAD: _MM_PERM_ENUM = 83;
pub const _MM_PERM_BBBA: _MM_PERM_ENUM = 84;
pub const _MM_PERM_BBBB: _MM_PERM_ENUM = 85;
pub const _MM_PERM_BBBC: _MM_PERM_ENUM = 86;
pub const _MM_PERM_BBBD: _MM_PERM_ENUM = 87;
pub const _MM_PERM_BBCA: _MM_PERM_ENUM = 88;
pub const _MM_PERM_BBCB: _MM_PERM_ENUM = 89;
pub const _MM_PERM_BBCC: _MM_PERM_ENUM = 90;
pub const _MM_PERM_BBCD: _MM_PERM_ENUM = 91;
pub const _MM_PERM_BBDA: _MM_PERM_ENUM = 92;
pub const _MM_PERM_BBDB: _MM_PERM_ENUM = 93;
pub const _MM_PERM_BBDC: _MM_PERM_ENUM = 94;
pub const _MM_PERM_BBDD: _MM_PERM_ENUM = 95;
pub const _MM_PERM_BCAA: _MM_PERM_ENUM = 96;
pub const _MM_PERM_BCAB: _MM_PERM_ENUM = 97;
pub const _MM_PERM_BCAC: _MM_PERM_ENUM = 98;
pub const _MM_PERM_BCAD: _MM_PERM_ENUM = 99;
pub const _MM_PERM_BCBA: _MM_PERM_ENUM = 100;
pub const _MM_PERM_BCBB: _MM_PERM_ENUM = 101;
pub const _MM_PERM_BCBC: _MM_PERM_ENUM = 102;
pub const _MM_PERM_BCBD: _MM_PERM_ENUM = 103;
pub const _MM_PERM_BCCA: _MM_PERM_ENUM = 104;
pub const _MM_PERM_BCCB: _MM_PERM_ENUM = 105;
pub const _MM_PERM_BCCC: _MM_PERM_ENUM = 106;
pub const _MM_PERM_BCCD: _MM_PERM_ENUM = 107;
pub const _MM_PERM_BCDA: _MM_PERM_ENUM = 108;
pub const _MM_PERM_BCDB: _MM_PERM_ENUM = 109;
pub const _MM_PERM_BCDC: _MM_PERM_ENUM = 110;
pub const _MM_PERM_BCDD: _MM_PERM_ENUM = 111;
pub const _MM_PERM_BDAA: _MM_PERM_ENUM = 112;
pub const _MM_PERM_BDAB: _MM_PERM_ENUM = 113;
pub const _MM_PERM_BDAC: _MM_PERM_ENUM = 114;
pub const _MM_PERM_BDAD: _MM_PERM_ENUM = 115;
pub const _MM_PERM_BDBA: _MM_PERM_ENUM = 116;
pub const _MM_PERM_BDBB: _MM_PERM_ENUM = 117;
pub const _MM_PERM_BDBC: _MM_PERM_ENUM = 118;
pub const _MM_PERM_BDBD: _MM_PERM_ENUM = 119;
pub const _MM_PERM_BDCA: _MM_PERM_ENUM = 120;
pub const _MM_PERM_BDCB: _MM_PERM_ENUM = 121;
pub const _MM_PERM_BDCC: _MM_PERM_ENUM = 122;
pub const _MM_PERM_BDCD: _MM_PERM_ENUM = 123;
pub const _MM_PERM_BDDA: _MM_PERM_ENUM = 124;
pub const _MM_PERM_BDDB: _MM_PERM_ENUM = 125;
pub const _MM_PERM_BDDC: _MM_PERM_ENUM = 126;
pub const _MM_PERM_BDDD: _MM_PERM_ENUM = 127;
pub const _MM_PERM_CAAA: _MM_PERM_ENUM = 128;
pub const _MM_PERM_CAAB: _MM_PERM_ENUM = 129;
pub const _MM_PERM_CAAC: _MM_PERM_ENUM = 130;
pub const _MM_PERM_CAAD: _MM_PERM_ENUM = 131;
pub const _MM_PERM_CABA: _MM_PERM_ENUM = 132;
pub const _MM_PERM_CABB: _MM_PERM_ENUM = 133;
pub const _MM_PERM_CABC: _MM_PERM_ENUM = 134;
pub const _MM_PERM_CABD: _MM_PERM_ENUM = 135;
pub const _MM_PERM_CACA: _MM_PERM_ENUM = 136;
pub const _MM_PERM_CACB: _MM_PERM_ENUM = 137;
pub const _MM_PERM_CACC: _MM_PERM_ENUM = 138;
pub const _MM_PERM_CACD: _MM_PERM_ENUM = 139;
pub const _MM_PERM_CADA: _MM_PERM_ENUM = 140;
pub const _MM_PERM_CADB: _MM_PERM_ENUM = 141;
pub const _MM_PERM_CADC: _MM_PERM_ENUM = 142;
pub const _MM_PERM_CADD: _MM_PERM_ENUM = 143;
pub const _MM_PERM_CBAA: _MM_PERM_ENUM = 144;
pub const _MM_PERM_CBAB: _MM_PERM_ENUM = 145;
pub const _MM_PERM_CBAC: _MM_PERM_ENUM = 146;
pub const _MM_PERM_CBAD: _MM_PERM_ENUM = 147;
pub const _MM_PERM_CBBA: _MM_PERM_ENUM = 148;
pub const _MM_PERM_CBBB: _MM_PERM_ENUM = 149;
pub const _MM_PERM_CBBC: _MM_PERM_ENUM = 150;
pub const _MM_PERM_CBBD: _MM_PERM_ENUM = 151;
pub const _MM_PERM_CBCA: _MM_PERM_ENUM = 152;
pub const _MM_PERM_CBCB: _MM_PERM_ENUM = 153;
pub const _MM_PERM_CBCC: _MM_PERM_ENUM = 154;
pub const _MM_PERM_CBCD: _MM_PERM_ENUM = 155;
pub const _MM_PERM_CBDA: _MM_PERM_ENUM = 156;
pub const _MM_PERM_CBDB: _MM_PERM_ENUM = 157;
pub const _MM_PERM_CBDC: _MM_PERM_ENUM = 158;
pub const _MM_PERM_CBDD: _MM_PERM_ENUM = 159;
pub const _MM_PERM_CCAA: _MM_PERM_ENUM = 160;
pub const _MM_PERM_CCAB: _MM_PERM_ENUM = 161;
pub const _MM_PERM_CCAC: _MM_PERM_ENUM = 162;
pub const _MM_PERM_CCAD: _MM_PERM_ENUM = 163;
pub const _MM_PERM_CCBA: _MM_PERM_ENUM = 164;
pub const _MM_PERM_CCBB: _MM_PERM_ENUM = 165;
pub const _MM_PERM_CCBC: _MM_PERM_ENUM = 166;
pub const _MM_PERM_CCBD: _MM_PERM_ENUM = 167;
pub const _MM_PERM_CCCA: _MM_PERM_ENUM = 168;
pub const _MM_PERM_CCCB: _MM_PERM_ENUM = 169;
pub const _MM_PERM_CCCC: _MM_PERM_ENUM = 170;
pub const _MM_PERM_CCCD: _MM_PERM_ENUM = 171;
pub const _MM_PERM_CCDA: _MM_PERM_ENUM = 172;
pub const _MM_PERM_CCDB: _MM_PERM_ENUM = 173;
pub const _MM_PERM_CCDC: _MM_PERM_ENUM = 174;
pub const _MM_PERM_CCDD: _MM_PERM_ENUM = 175;
pub const _MM_PERM_CDAA: _MM_PERM_ENUM = 176;
pub const _MM_PERM_CDAB: _MM_PERM_ENUM = 177;
pub const _MM_PERM_CDAC: _MM_PERM_ENUM = 178;
pub const _MM_PERM_CDAD: _MM_PERM_ENUM = 179;
pub const _MM_PERM_CDBA: _MM_PERM_ENUM = 180;
pub const _MM_PERM_CDBB: _MM_PERM_ENUM = 181;
pub const _MM_PERM_CDBC: _MM_PERM_ENUM = 182;
pub const _MM_PERM_CDBD: _MM_PERM_ENUM = 183;
pub const _MM_PERM_CDCA: _MM_PERM_ENUM = 184;
pub const _MM_PERM_CDCB: _MM_PERM_ENUM = 185;
pub const _MM_PERM_CDCC: _MM_PERM_ENUM = 186;
pub const _MM_PERM_CDCD: _MM_PERM_ENUM = 187;
pub const _MM_PERM_CDDA: _MM_PERM_ENUM = 188;
pub const _MM_PERM_CDDB: _MM_PERM_ENUM = 189;
pub const _MM_PERM_CDDC: _MM_PERM_ENUM = 190;
pub const _MM_PERM_CDDD: _MM_PERM_ENUM = 191;
pub const _MM_PERM_DAAA: _MM_PERM_ENUM = 192;
pub const _MM_PERM_DAAB: _MM_PERM_ENUM = 193;
pub const _MM_PERM_DAAC: _MM_PERM_ENUM = 194;
pub const _MM_PERM_DAAD: _MM_PERM_ENUM = 195;
pub const _MM_PERM_DABA: _MM_PERM_ENUM = 196;
pub const _MM_PERM_DABB: _MM_PERM_ENUM = 197;
pub const _MM_PERM_DABC: _MM_PERM_ENUM = 198;
pub const _MM_PERM_DABD: _MM_PERM_ENUM = 199;
pub const _MM_PERM_DACA: _MM_PERM_ENUM = 200;
pub const _MM_PERM_DACB: _MM_PERM_ENUM = 201;
pub const _MM_PERM_DACC: _MM_PERM_ENUM = 202;
pub const _MM_PERM_DACD: _MM_PERM_ENUM = 203;
pub const _MM_PERM_DADA: _MM_PERM_ENUM = 204;
pub const _MM_PERM_DADB: _MM_PERM_ENUM = 205;
pub const _MM_PERM_DADC: _MM_PERM_ENUM = 206;
pub const _MM_PERM_DADD: _MM_PERM_ENUM = 207;
pub const _MM_PERM_DBAA: _MM_PERM_ENUM = 208;
pub const _MM_PERM_DBAB: _MM_PERM_ENUM = 209;
pub const _MM_PERM_DBAC: _MM_PERM_ENUM = 210;
pub const _MM_PERM_DBAD: _MM_PERM_ENUM = 211;
pub const _MM_PERM_DBBA: _MM_PERM_ENUM = 212;
pub const _MM_PERM_DBBB: _MM_PERM_ENUM = 213;
pub const _MM_PERM_DBBC: _MM_PERM_ENUM = 214;
pub const _MM_PERM_DBBD: _MM_PERM_ENUM = 215;
pub const _MM_PERM_DBCA: _MM_PERM_ENUM = 216;
pub const _MM_PERM_DBCB: _MM_PERM_ENUM = 217;
pub const _MM_PERM_DBCC: _MM_PERM_ENUM = 218;
pub const _MM_PERM_DBCD: _MM_PERM_ENUM = 219;
pub const _MM_PERM_DBDA: _MM_PERM_ENUM = 220;
pub const _MM_PERM_DBDB: _MM_PERM_ENUM = 221;
pub const _MM_PERM_DBDC: _MM_PERM_ENUM = 222;
pub const _MM_PERM_DBDD: _MM_PERM_ENUM = 223;
pub const _MM_PERM_DCAA: _MM_PERM_ENUM = 224;
pub const _MM_PERM_DCAB: _MM_PERM_ENUM = 225;
pub const _MM_PERM_DCAC: _MM_PERM_ENUM = 226;
pub const _MM_PERM_DCAD: _MM_PERM_ENUM = 227;
pub const _MM_PERM_DCBA: _MM_PERM_ENUM = 228;
pub const _MM_PERM_DCBB: _MM_PERM_ENUM = 229;
pub const _MM_PERM_DCBC: _MM_PERM_ENUM = 230;
pub const _MM_PERM_DCBD: _MM_PERM_ENUM = 231;
pub const _MM_PERM_DCCA: _MM_PERM_ENUM = 232;
pub const _MM_PERM_DCCB: _MM_PERM_ENUM = 233;
pub const _MM_PERM_DCCC: _MM_PERM_ENUM = 234;
pub const _MM_PERM_DCCD: _MM_PERM_ENUM = 235;
pub const _MM_PERM_DCDA: _MM_PERM_ENUM = 236;
pub const _MM_PERM_DCDB: _MM_PERM_ENUM = 237;
pub const _MM_PERM_DCDC: _MM_PERM_ENUM = 238;
pub const _MM_PERM_DCDD: _MM_PERM_ENUM = 239;
pub const _MM_PERM_DDAA: _MM_PERM_ENUM = 240;
pub const _MM_PERM_DDAB: _MM_PERM_ENUM = 241;
pub const _MM_PERM_DDAC: _MM_PERM_ENUM = 242;
pub const _MM_PERM_DDAD: _MM_PERM_ENUM = 243;
pub const _MM_PERM_DDBA: _MM_PERM_ENUM = 244;
pub const _MM_PERM_DDBB: _MM_PERM_ENUM = 245;
pub const _MM_PERM_DDBC: _MM_PERM_ENUM = 246;
pub const _MM_PERM_DDBD: _MM_PERM_ENUM = 247;
pub const _MM_PERM_DDCA: _MM_PERM_ENUM = 248;
pub const _MM_PERM_DDCB: _MM_PERM_ENUM = 249;
pub const _MM_PERM_DDCC: _MM_PERM_ENUM = 250;
pub const _MM_PERM_DDCD: _MM_PERM_ENUM = 251;
pub const _MM_PERM_DDDA: _MM_PERM_ENUM = 252;
pub const _MM_PERM_DDDB: _MM_PERM_ENUM = 253;
pub const _MM_PERM_DDDC: _MM_PERM_ENUM = 254;
pub const _MM_PERM_DDDD: _MM_PERM_ENUM = 255;
pub type _MM_PERM_ENUM = ctypes::c_uint;
pub const _MM_MANT_NORM_1_2: _MM_MANTISSA_NORM_ENUM = 0;
pub const _MM_MANT_NORM_p5_2: _MM_MANTISSA_NORM_ENUM = 1;
pub const _MM_MANT_NORM_p5_1: _MM_MANTISSA_NORM_ENUM = 2;
pub const _MM_MANT_NORM_p75_1p5: _MM_MANTISSA_NORM_ENUM = 3;
pub type _MM_MANTISSA_NORM_ENUM = ctypes::c_uint;
pub const _MM_MANT_SIGN_src: _MM_MANTISSA_SIGN_ENUM = 0;
pub const _MM_MANT_SIGN_zero: _MM_MANTISSA_SIGN_ENUM = 1;
pub const _MM_MANT_SIGN_nan: _MM_MANTISSA_SIGN_ENUM = 2;
pub type _MM_MANTISSA_SIGN_ENUM = ctypes::c_uint;
pub type __v2hi = [ctypes::c_short; 2usize];
pub type __v4qi = [ctypes::c_char; 4usize];
pub type __v2qi = [ctypes::c_char; 2usize];
pub type __mmask32 = ctypes::c_uint;
pub type __mmask64 = ctypes::c_ulonglong;
pub type __m512bh = [ctypes::c_short; 32usize];
pub type __m256bh = [ctypes::c_short; 16usize];
pub type __bfloat16 = ctypes::c_ushort;
pub type __m128bh = [ctypes::c_short; 8usize];
pub type _tile1024i = [ctypes::c_int; 256usize];
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub struct __tile1024i_str {
    pub row: ctypes::c_ushort,
    pub col: ctypes::c_ushort,
    pub __bindgen_padding_0: [u64; 7usize],
    pub tile: _tile1024i,
}
#[test]
fn bindgen_test_layout___tile1024i_str() {
    assert_eq!(
        ::core::mem::size_of::<__tile1024i_str>(),
        1088usize,
        concat!("Size of: ", stringify!(__tile1024i_str))
    );
    assert_eq!(
        ::core::mem::align_of::<__tile1024i_str>(),
        64usize,
        concat!("Alignment of ", stringify!(__tile1024i_str))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__tile1024i_str>())).row as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__tile1024i_str),
            "::",
            stringify!(row)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__tile1024i_str>())).col as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__tile1024i_str),
            "::",
            stringify!(col)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__tile1024i_str>())).tile as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__tile1024i_str),
            "::",
            stringify!(tile)
        )
    );
}
impl Default for __tile1024i_str {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __tile1024i = __tile1024i_str;
extern "C" {
    pub fn SDL_GetCPUCount() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetCPUCacheLineSize() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_HasRDTSC() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasAltiVec() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasMMX() -> SDL_bool;
}
extern "C" {
    pub fn SDL_Has3DNow() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasSSE() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasSSE2() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasSSE3() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasSSE41() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasSSE42() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasAVX() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasAVX2() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasAVX512F() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasARMSIMD() -> SDL_bool;
}
extern "C" {
    pub fn SDL_HasNEON() -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetSystemRAM() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SIMDGetAlignment() -> size_t;
}
extern "C" {
    pub fn SDL_SIMDAlloc(len: size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_SIMDRealloc(mem: *mut ctypes::c_void, len: size_t) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_SIMDFree(ptr: *mut ctypes::c_void);
}
pub const SDL_PIXELTYPE_UNKNOWN: SDL_PixelType = 0;
pub const SDL_PIXELTYPE_INDEX1: SDL_PixelType = 1;
pub const SDL_PIXELTYPE_INDEX4: SDL_PixelType = 2;
pub const SDL_PIXELTYPE_INDEX8: SDL_PixelType = 3;
pub const SDL_PIXELTYPE_PACKED8: SDL_PixelType = 4;
pub const SDL_PIXELTYPE_PACKED16: SDL_PixelType = 5;
pub const SDL_PIXELTYPE_PACKED32: SDL_PixelType = 6;
pub const SDL_PIXELTYPE_ARRAYU8: SDL_PixelType = 7;
pub const SDL_PIXELTYPE_ARRAYU16: SDL_PixelType = 8;
pub const SDL_PIXELTYPE_ARRAYU32: SDL_PixelType = 9;
pub const SDL_PIXELTYPE_ARRAYF16: SDL_PixelType = 10;
pub const SDL_PIXELTYPE_ARRAYF32: SDL_PixelType = 11;
pub type SDL_PixelType = ctypes::c_uint;
pub const SDL_BITMAPORDER_NONE: SDL_BitmapOrder = 0;
pub const SDL_BITMAPORDER_4321: SDL_BitmapOrder = 1;
pub const SDL_BITMAPORDER_1234: SDL_BitmapOrder = 2;
pub type SDL_BitmapOrder = ctypes::c_uint;
pub const SDL_PACKEDORDER_NONE: SDL_PackedOrder = 0;
pub const SDL_PACKEDORDER_XRGB: SDL_PackedOrder = 1;
pub const SDL_PACKEDORDER_RGBX: SDL_PackedOrder = 2;
pub const SDL_PACKEDORDER_ARGB: SDL_PackedOrder = 3;
pub const SDL_PACKEDORDER_RGBA: SDL_PackedOrder = 4;
pub const SDL_PACKEDORDER_XBGR: SDL_PackedOrder = 5;
pub const SDL_PACKEDORDER_BGRX: SDL_PackedOrder = 6;
pub const SDL_PACKEDORDER_ABGR: SDL_PackedOrder = 7;
pub const SDL_PACKEDORDER_BGRA: SDL_PackedOrder = 8;
pub type SDL_PackedOrder = ctypes::c_uint;
pub const SDL_ARRAYORDER_NONE: SDL_ArrayOrder = 0;
pub const SDL_ARRAYORDER_RGB: SDL_ArrayOrder = 1;
pub const SDL_ARRAYORDER_RGBA: SDL_ArrayOrder = 2;
pub const SDL_ARRAYORDER_ARGB: SDL_ArrayOrder = 3;
pub const SDL_ARRAYORDER_BGR: SDL_ArrayOrder = 4;
pub const SDL_ARRAYORDER_BGRA: SDL_ArrayOrder = 5;
pub const SDL_ARRAYORDER_ABGR: SDL_ArrayOrder = 6;
pub type SDL_ArrayOrder = ctypes::c_uint;
pub const SDL_PACKEDLAYOUT_NONE: SDL_PackedLayout = 0;
pub const SDL_PACKEDLAYOUT_332: SDL_PackedLayout = 1;
pub const SDL_PACKEDLAYOUT_4444: SDL_PackedLayout = 2;
pub const SDL_PACKEDLAYOUT_1555: SDL_PackedLayout = 3;
pub const SDL_PACKEDLAYOUT_5551: SDL_PackedLayout = 4;
pub const SDL_PACKEDLAYOUT_565: SDL_PackedLayout = 5;
pub const SDL_PACKEDLAYOUT_8888: SDL_PackedLayout = 6;
pub const SDL_PACKEDLAYOUT_2101010: SDL_PackedLayout = 7;
pub const SDL_PACKEDLAYOUT_1010102: SDL_PackedLayout = 8;
pub type SDL_PackedLayout = ctypes::c_uint;
pub const SDL_PIXELFORMAT_UNKNOWN: SDL_PixelFormatEnum = 0;
pub const SDL_PIXELFORMAT_INDEX1LSB: SDL_PixelFormatEnum = 286261504;
pub const SDL_PIXELFORMAT_INDEX1MSB: SDL_PixelFormatEnum = 287310080;
pub const SDL_PIXELFORMAT_INDEX4LSB: SDL_PixelFormatEnum = 303039488;
pub const SDL_PIXELFORMAT_INDEX4MSB: SDL_PixelFormatEnum = 304088064;
pub const SDL_PIXELFORMAT_INDEX8: SDL_PixelFormatEnum = 318769153;
pub const SDL_PIXELFORMAT_RGB332: SDL_PixelFormatEnum = 336660481;
pub const SDL_PIXELFORMAT_XRGB4444: SDL_PixelFormatEnum = 353504258;
pub const SDL_PIXELFORMAT_RGB444: SDL_PixelFormatEnum = 353504258;
pub const SDL_PIXELFORMAT_XBGR4444: SDL_PixelFormatEnum = 357698562;
pub const SDL_PIXELFORMAT_BGR444: SDL_PixelFormatEnum = 357698562;
pub const SDL_PIXELFORMAT_XRGB1555: SDL_PixelFormatEnum = 353570562;
pub const SDL_PIXELFORMAT_RGB555: SDL_PixelFormatEnum = 353570562;
pub const SDL_PIXELFORMAT_XBGR1555: SDL_PixelFormatEnum = 357764866;
pub const SDL_PIXELFORMAT_BGR555: SDL_PixelFormatEnum = 357764866;
pub const SDL_PIXELFORMAT_ARGB4444: SDL_PixelFormatEnum = 355602434;
pub const SDL_PIXELFORMAT_RGBA4444: SDL_PixelFormatEnum = 356651010;
pub const SDL_PIXELFORMAT_ABGR4444: SDL_PixelFormatEnum = 359796738;
pub const SDL_PIXELFORMAT_BGRA4444: SDL_PixelFormatEnum = 360845314;
pub const SDL_PIXELFORMAT_ARGB1555: SDL_PixelFormatEnum = 355667970;
pub const SDL_PIXELFORMAT_RGBA5551: SDL_PixelFormatEnum = 356782082;
pub const SDL_PIXELFORMAT_ABGR1555: SDL_PixelFormatEnum = 359862274;
pub const SDL_PIXELFORMAT_BGRA5551: SDL_PixelFormatEnum = 360976386;
pub const SDL_PIXELFORMAT_RGB565: SDL_PixelFormatEnum = 353701890;
pub const SDL_PIXELFORMAT_BGR565: SDL_PixelFormatEnum = 357896194;
pub const SDL_PIXELFORMAT_RGB24: SDL_PixelFormatEnum = 386930691;
pub const SDL_PIXELFORMAT_BGR24: SDL_PixelFormatEnum = 390076419;
pub const SDL_PIXELFORMAT_XRGB8888: SDL_PixelFormatEnum = 370546692;
pub const SDL_PIXELFORMAT_RGB888: SDL_PixelFormatEnum = 370546692;
pub const SDL_PIXELFORMAT_RGBX8888: SDL_PixelFormatEnum = 371595268;
pub const SDL_PIXELFORMAT_XBGR8888: SDL_PixelFormatEnum = 374740996;
pub const SDL_PIXELFORMAT_BGR888: SDL_PixelFormatEnum = 374740996;
pub const SDL_PIXELFORMAT_BGRX8888: SDL_PixelFormatEnum = 375789572;
pub const SDL_PIXELFORMAT_ARGB8888: SDL_PixelFormatEnum = 372645892;
pub const SDL_PIXELFORMAT_RGBA8888: SDL_PixelFormatEnum = 373694468;
pub const SDL_PIXELFORMAT_ABGR8888: SDL_PixelFormatEnum = 376840196;
pub const SDL_PIXELFORMAT_BGRA8888: SDL_PixelFormatEnum = 377888772;
pub const SDL_PIXELFORMAT_ARGB2101010: SDL_PixelFormatEnum = 372711428;
pub const SDL_PIXELFORMAT_RGBA32: SDL_PixelFormatEnum = 376840196;
pub const SDL_PIXELFORMAT_ARGB32: SDL_PixelFormatEnum = 377888772;
pub const SDL_PIXELFORMAT_BGRA32: SDL_PixelFormatEnum = 372645892;
pub const SDL_PIXELFORMAT_ABGR32: SDL_PixelFormatEnum = 373694468;
pub const SDL_PIXELFORMAT_YV12: SDL_PixelFormatEnum = 842094169;
pub const SDL_PIXELFORMAT_IYUV: SDL_PixelFormatEnum = 1448433993;
pub const SDL_PIXELFORMAT_YUY2: SDL_PixelFormatEnum = 844715353;
pub const SDL_PIXELFORMAT_UYVY: SDL_PixelFormatEnum = 1498831189;
pub const SDL_PIXELFORMAT_YVYU: SDL_PixelFormatEnum = 1431918169;
pub const SDL_PIXELFORMAT_NV12: SDL_PixelFormatEnum = 842094158;
pub const SDL_PIXELFORMAT_NV21: SDL_PixelFormatEnum = 825382478;
pub const SDL_PIXELFORMAT_EXTERNAL_OES: SDL_PixelFormatEnum = 542328143;
pub type SDL_PixelFormatEnum = ctypes::c_uint;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub a: Uint8,
}
#[test]
fn bindgen_test_layout_SDL_Color() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Color>(),
        4usize,
        concat!("Size of: ", stringify!(SDL_Color))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Color>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_Color))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Color>())).a as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Color),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Palette {
    pub ncolors: ctypes::c_int,
    pub colors: *mut SDL_Color,
    pub version: Uint32,
    pub refcount: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Palette() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Palette>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_Palette))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Palette>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Palette))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).ncolors as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(ncolors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).colors as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).version as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Palette>())).refcount as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Palette),
            "::",
            stringify!(refcount)
        )
    );
}
impl Default for SDL_Palette {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_PixelFormat {
    pub format: Uint32,
    pub palette: *mut SDL_Palette,
    pub BitsPerPixel: Uint8,
    pub BytesPerPixel: Uint8,
    pub padding: [Uint8; 2usize],
    pub Rmask: Uint32,
    pub Gmask: Uint32,
    pub Bmask: Uint32,
    pub Amask: Uint32,
    pub Rloss: Uint8,
    pub Gloss: Uint8,
    pub Bloss: Uint8,
    pub Aloss: Uint8,
    pub Rshift: Uint8,
    pub Gshift: Uint8,
    pub Bshift: Uint8,
    pub Ashift: Uint8,
    pub refcount: ctypes::c_int,
    pub next: *mut SDL_PixelFormat,
}
#[test]
fn bindgen_test_layout_SDL_PixelFormat() {
    assert_eq!(
        ::core::mem::size_of::<SDL_PixelFormat>(),
        56usize,
        concat!("Size of: ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_PixelFormat>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_PixelFormat))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).palette as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(palette)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).BitsPerPixel as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).BytesPerPixel as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(BytesPerPixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).padding as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rmask as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gmask as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bmask as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Amask as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Amask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rloss as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gloss as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bloss as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Aloss as *const _ as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Aloss)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Rshift as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Rshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Gshift as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Gshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Bshift as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Bshift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).Ashift as *const _ as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(Ashift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).refcount as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_PixelFormat>())).next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_PixelFormat),
            "::",
            stringify!(next)
        )
    );
}
impl Default for SDL_PixelFormat {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SDL_GetPixelFormatName(format: Uint32) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_PixelFormatEnumToMasks(
        format: Uint32,
        bpp: *mut ctypes::c_int,
        Rmask: *mut Uint32,
        Gmask: *mut Uint32,
        Bmask: *mut Uint32,
        Amask: *mut Uint32,
    ) -> SDL_bool;
}
extern "C" {
    pub fn SDL_MasksToPixelFormatEnum(
        bpp: ctypes::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> Uint32;
}
extern "C" {
    pub fn SDL_AllocFormat(pixel_format: Uint32) -> *mut SDL_PixelFormat;
}
extern "C" {
    pub fn SDL_FreeFormat(format: *mut SDL_PixelFormat);
}
extern "C" {
    pub fn SDL_AllocPalette(ncolors: ctypes::c_int) -> *mut SDL_Palette;
}
extern "C" {
    pub fn SDL_SetPixelFormatPalette(
        format: *mut SDL_PixelFormat,
        palette: *mut SDL_Palette,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetPaletteColors(
        palette: *mut SDL_Palette,
        colors: *const SDL_Color,
        firstcolor: ctypes::c_int,
        ncolors: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_FreePalette(palette: *mut SDL_Palette);
}
extern "C" {
    pub fn SDL_MapRGB(format: *const SDL_PixelFormat, r: Uint8, g: Uint8, b: Uint8) -> Uint32;
}
extern "C" {
    pub fn SDL_MapRGBA(
        format: *const SDL_PixelFormat,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> Uint32;
}
extern "C" {
    pub fn SDL_GetRGB(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    );
}
extern "C" {
    pub fn SDL_GetRGBA(
        pixel: Uint32,
        format: *const SDL_PixelFormat,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    );
}
extern "C" {
    pub fn SDL_CalculateGammaRamp(gamma: f32, ramp: *mut Uint16);
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct SDL_Point {
    pub x: ctypes::c_int,
    pub y: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Point() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Point>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_Point))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Point>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Point))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Point>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Point>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Point),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct SDL_FPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_SDL_FPoint() {
    assert_eq!(
        ::core::mem::size_of::<SDL_FPoint>(),
        8usize,
        concat!("Size of: ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FPoint))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FPoint>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FPoint>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FPoint),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct SDL_Rect {
    pub x: ctypes::c_int,
    pub y: ctypes::c_int,
    pub w: ctypes::c_int,
    pub h: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Rect() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Rect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Rect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Rect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Rect))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Rect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Rect),
            "::",
            stringify!(h)
        )
    );
}
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct SDL_FRect {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[test]
fn bindgen_test_layout_SDL_FRect() {
    assert_eq!(
        ::core::mem::size_of::<SDL_FRect>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_FRect))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_FRect>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_FRect))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_FRect>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_FRect),
            "::",
            stringify!(h)
        )
    );
}
extern "C" {
    pub fn SDL_HasIntersection(A: *const SDL_Rect, B: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    pub fn SDL_IntersectRect(
        A: *const SDL_Rect,
        B: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    pub fn SDL_UnionRect(A: *const SDL_Rect, B: *const SDL_Rect, result: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_EnclosePoints(
        points: *const SDL_Point,
        count: ctypes::c_int,
        clip: *const SDL_Rect,
        result: *mut SDL_Rect,
    ) -> SDL_bool;
}
extern "C" {
    pub fn SDL_IntersectRectAndLine(
        rect: *const SDL_Rect,
        X1: *mut ctypes::c_int,
        Y1: *mut ctypes::c_int,
        X2: *mut ctypes::c_int,
        Y2: *mut ctypes::c_int,
    ) -> SDL_bool;
}
pub const SDL_BLENDMODE_NONE: SDL_BlendMode = 0;
pub const SDL_BLENDMODE_BLEND: SDL_BlendMode = 1;
pub const SDL_BLENDMODE_ADD: SDL_BlendMode = 2;
pub const SDL_BLENDMODE_MOD: SDL_BlendMode = 4;
pub const SDL_BLENDMODE_MUL: SDL_BlendMode = 8;
pub const SDL_BLENDMODE_INVALID: SDL_BlendMode = 2147483647;
pub type SDL_BlendMode = ctypes::c_uint;
pub const SDL_BLENDOPERATION_ADD: SDL_BlendOperation = 1;
pub const SDL_BLENDOPERATION_SUBTRACT: SDL_BlendOperation = 2;
pub const SDL_BLENDOPERATION_REV_SUBTRACT: SDL_BlendOperation = 3;
pub const SDL_BLENDOPERATION_MINIMUM: SDL_BlendOperation = 4;
pub const SDL_BLENDOPERATION_MAXIMUM: SDL_BlendOperation = 5;
pub type SDL_BlendOperation = ctypes::c_uint;
pub const SDL_BLENDFACTOR_ZERO: SDL_BlendFactor = 1;
pub const SDL_BLENDFACTOR_ONE: SDL_BlendFactor = 2;
pub const SDL_BLENDFACTOR_SRC_COLOR: SDL_BlendFactor = 3;
pub const SDL_BLENDFACTOR_ONE_MINUS_SRC_COLOR: SDL_BlendFactor = 4;
pub const SDL_BLENDFACTOR_SRC_ALPHA: SDL_BlendFactor = 5;
pub const SDL_BLENDFACTOR_ONE_MINUS_SRC_ALPHA: SDL_BlendFactor = 6;
pub const SDL_BLENDFACTOR_DST_COLOR: SDL_BlendFactor = 7;
pub const SDL_BLENDFACTOR_ONE_MINUS_DST_COLOR: SDL_BlendFactor = 8;
pub const SDL_BLENDFACTOR_DST_ALPHA: SDL_BlendFactor = 9;
pub const SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA: SDL_BlendFactor = 10;
pub type SDL_BlendFactor = ctypes::c_uint;
extern "C" {
    pub fn SDL_ComposeCustomBlendMode(
        srcColorFactor: SDL_BlendFactor,
        dstColorFactor: SDL_BlendFactor,
        colorOperation: SDL_BlendOperation,
        srcAlphaFactor: SDL_BlendFactor,
        dstAlphaFactor: SDL_BlendFactor,
        alphaOperation: SDL_BlendOperation,
    ) -> SDL_BlendMode;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Surface {
    pub flags: Uint32,
    pub format: *mut SDL_PixelFormat,
    pub w: ctypes::c_int,
    pub h: ctypes::c_int,
    pub pitch: ctypes::c_int,
    pub pixels: *mut ctypes::c_void,
    pub userdata: *mut ctypes::c_void,
    pub locked: ctypes::c_int,
    pub list_blitmap: *mut ctypes::c_void,
    pub clip_rect: SDL_Rect,
    pub map: *mut SDL_BlitMap,
    pub refcount: ctypes::c_int,
}
#[test]
fn bindgen_test_layout_SDL_Surface() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Surface>(),
        96usize,
        concat!("Size of: ", stringify!(SDL_Surface))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Surface>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_Surface))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).format as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).w as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).h as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).pitch as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).pixels as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(pixels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).userdata as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).locked as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(locked)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).list_blitmap as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(list_blitmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).clip_rect as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(clip_rect)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).map as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Surface>())).refcount as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Surface),
            "::",
            stringify!(refcount)
        )
    );
}
impl Default for SDL_Surface {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SDL_blit = ::core::option::Option<
    unsafe extern "C" fn(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ctypes::c_int,
>;
pub const SDL_YUV_CONVERSION_JPEG: SDL_YUV_CONVERSION_MODE = 0;
pub const SDL_YUV_CONVERSION_BT601: SDL_YUV_CONVERSION_MODE = 1;
pub const SDL_YUV_CONVERSION_BT709: SDL_YUV_CONVERSION_MODE = 2;
pub const SDL_YUV_CONVERSION_AUTOMATIC: SDL_YUV_CONVERSION_MODE = 3;
pub type SDL_YUV_CONVERSION_MODE = ctypes::c_uint;
extern "C" {
    pub fn SDL_CreateRGBSurface(
        flags: Uint32,
        width: ctypes::c_int,
        height: ctypes::c_int,
        depth: ctypes::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceWithFormat(
        flags: Uint32,
        width: ctypes::c_int,
        height: ctypes::c_int,
        depth: ctypes::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceFrom(
        pixels: *mut ctypes::c_void,
        width: ctypes::c_int,
        height: ctypes::c_int,
        depth: ctypes::c_int,
        pitch: ctypes::c_int,
        Rmask: Uint32,
        Gmask: Uint32,
        Bmask: Uint32,
        Amask: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_CreateRGBSurfaceWithFormatFrom(
        pixels: *mut ctypes::c_void,
        width: ctypes::c_int,
        height: ctypes::c_int,
        depth: ctypes::c_int,
        pitch: ctypes::c_int,
        format: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_FreeSurface(surface: *mut SDL_Surface);
}
extern "C" {
    pub fn SDL_SetSurfacePalette(
        surface: *mut SDL_Surface,
        palette: *mut SDL_Palette,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_LockSurface(surface: *mut SDL_Surface) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_UnlockSurface(surface: *mut SDL_Surface);
}
extern "C" {
    pub fn SDL_LoadBMP_RW(src: *mut SDL_RWops, freesrc: ctypes::c_int) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_SaveBMP_RW(
        surface: *mut SDL_Surface,
        dst: *mut SDL_RWops,
        freedst: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetSurfaceRLE(surface: *mut SDL_Surface, flag: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_HasSurfaceRLE(surface: *mut SDL_Surface) -> SDL_bool;
}
extern "C" {
    pub fn SDL_SetColorKey(
        surface: *mut SDL_Surface,
        flag: ctypes::c_int,
        key: Uint32,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_HasColorKey(surface: *mut SDL_Surface) -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetColorKey(surface: *mut SDL_Surface, key: *mut Uint32) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: Uint8,
        g: Uint8,
        b: Uint8,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetSurfaceColorMod(
        surface: *mut SDL_Surface,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: Uint8) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetSurfaceAlphaMod(surface: *mut SDL_Surface, alpha: *mut Uint8) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: SDL_BlendMode,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetSurfaceBlendMode(
        surface: *mut SDL_Surface,
        blendMode: *mut SDL_BlendMode,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetClipRect(surface: *mut SDL_Surface, rect: *const SDL_Rect) -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetClipRect(surface: *mut SDL_Surface, rect: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_DuplicateSurface(surface: *mut SDL_Surface) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_ConvertSurface(
        src: *mut SDL_Surface,
        fmt: *const SDL_PixelFormat,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_ConvertSurfaceFormat(
        src: *mut SDL_Surface,
        pixel_format: Uint32,
        flags: Uint32,
    ) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_ConvertPixels(
        width: ctypes::c_int,
        height: ctypes::c_int,
        src_format: Uint32,
        src: *const ctypes::c_void,
        src_pitch: ctypes::c_int,
        dst_format: Uint32,
        dst: *mut ctypes::c_void,
        dst_pitch: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_FillRect(
        dst: *mut SDL_Surface,
        rect: *const SDL_Rect,
        color: Uint32,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_FillRects(
        dst: *mut SDL_Surface,
        rects: *const SDL_Rect,
        count: ctypes::c_int,
        color: Uint32,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_UpperBlit(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_LowerBlit(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SoftStretch(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SoftStretchLinear(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *const SDL_Rect,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_UpperBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *const SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_LowerBlitScaled(
        src: *mut SDL_Surface,
        srcrect: *mut SDL_Rect,
        dst: *mut SDL_Surface,
        dstrect: *mut SDL_Rect,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetYUVConversionMode(mode: SDL_YUV_CONVERSION_MODE);
}
extern "C" {
    pub fn SDL_GetYUVConversionMode() -> SDL_YUV_CONVERSION_MODE;
}
extern "C" {
    pub fn SDL_GetYUVConversionModeForResolution(
        width: ctypes::c_int,
        height: ctypes::c_int,
    ) -> SDL_YUV_CONVERSION_MODE;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_DisplayMode {
    pub format: Uint32,
    pub w: ctypes::c_int,
    pub h: ctypes::c_int,
    pub refresh_rate: ctypes::c_int,
    pub driverdata: *mut ctypes::c_void,
}
#[test]
fn bindgen_test_layout_SDL_DisplayMode() {
    assert_eq!(
        ::core::mem::size_of::<SDL_DisplayMode>(),
        24usize,
        concat!("Size of: ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_DisplayMode>(),
        8usize,
        concat!("Alignment of ", stringify!(SDL_DisplayMode))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).w as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).h as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).refresh_rate as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(refresh_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_DisplayMode>())).driverdata as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_DisplayMode),
            "::",
            stringify!(driverdata)
        )
    );
}
impl Default for SDL_DisplayMode {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Window {
    _unused: [u8; 0],
}
pub const SDL_WINDOW_FULLSCREEN: SDL_WindowFlags = 1;
pub const SDL_WINDOW_OPENGL: SDL_WindowFlags = 2;
pub const SDL_WINDOW_SHOWN: SDL_WindowFlags = 4;
pub const SDL_WINDOW_HIDDEN: SDL_WindowFlags = 8;
pub const SDL_WINDOW_BORDERLESS: SDL_WindowFlags = 16;
pub const SDL_WINDOW_RESIZABLE: SDL_WindowFlags = 32;
pub const SDL_WINDOW_MINIMIZED: SDL_WindowFlags = 64;
pub const SDL_WINDOW_MAXIMIZED: SDL_WindowFlags = 128;
pub const SDL_WINDOW_MOUSE_GRABBED: SDL_WindowFlags = 256;
pub const SDL_WINDOW_INPUT_FOCUS: SDL_WindowFlags = 512;
pub const SDL_WINDOW_MOUSE_FOCUS: SDL_WindowFlags = 1024;
pub const SDL_WINDOW_FULLSCREEN_DESKTOP: SDL_WindowFlags = 4097;
pub const SDL_WINDOW_FOREIGN: SDL_WindowFlags = 2048;
pub const SDL_WINDOW_ALLOW_HIGHDPI: SDL_WindowFlags = 8192;
pub const SDL_WINDOW_MOUSE_CAPTURE: SDL_WindowFlags = 16384;
pub const SDL_WINDOW_ALWAYS_ON_TOP: SDL_WindowFlags = 32768;
pub const SDL_WINDOW_SKIP_TASKBAR: SDL_WindowFlags = 65536;
pub const SDL_WINDOW_UTILITY: SDL_WindowFlags = 131072;
pub const SDL_WINDOW_TOOLTIP: SDL_WindowFlags = 262144;
pub const SDL_WINDOW_POPUP_MENU: SDL_WindowFlags = 524288;
pub const SDL_WINDOW_KEYBOARD_GRABBED: SDL_WindowFlags = 1048576;
pub const SDL_WINDOW_VULKAN: SDL_WindowFlags = 268435456;
pub const SDL_WINDOW_METAL: SDL_WindowFlags = 536870912;
pub const SDL_WINDOW_INPUT_GRABBED: SDL_WindowFlags = 256;
pub type SDL_WindowFlags = ctypes::c_uint;
pub const SDL_WINDOWEVENT_NONE: SDL_WindowEventID = 0;
pub const SDL_WINDOWEVENT_SHOWN: SDL_WindowEventID = 1;
pub const SDL_WINDOWEVENT_HIDDEN: SDL_WindowEventID = 2;
pub const SDL_WINDOWEVENT_EXPOSED: SDL_WindowEventID = 3;
pub const SDL_WINDOWEVENT_MOVED: SDL_WindowEventID = 4;
pub const SDL_WINDOWEVENT_RESIZED: SDL_WindowEventID = 5;
pub const SDL_WINDOWEVENT_SIZE_CHANGED: SDL_WindowEventID = 6;
pub const SDL_WINDOWEVENT_MINIMIZED: SDL_WindowEventID = 7;
pub const SDL_WINDOWEVENT_MAXIMIZED: SDL_WindowEventID = 8;
pub const SDL_WINDOWEVENT_RESTORED: SDL_WindowEventID = 9;
pub const SDL_WINDOWEVENT_ENTER: SDL_WindowEventID = 10;
pub const SDL_WINDOWEVENT_LEAVE: SDL_WindowEventID = 11;
pub const SDL_WINDOWEVENT_FOCUS_GAINED: SDL_WindowEventID = 12;
pub const SDL_WINDOWEVENT_FOCUS_LOST: SDL_WindowEventID = 13;
pub const SDL_WINDOWEVENT_CLOSE: SDL_WindowEventID = 14;
pub const SDL_WINDOWEVENT_TAKE_FOCUS: SDL_WindowEventID = 15;
pub const SDL_WINDOWEVENT_HIT_TEST: SDL_WindowEventID = 16;
pub type SDL_WindowEventID = ctypes::c_uint;
pub const SDL_DISPLAYEVENT_NONE: SDL_DisplayEventID = 0;
pub const SDL_DISPLAYEVENT_ORIENTATION: SDL_DisplayEventID = 1;
pub const SDL_DISPLAYEVENT_CONNECTED: SDL_DisplayEventID = 2;
pub const SDL_DISPLAYEVENT_DISCONNECTED: SDL_DisplayEventID = 3;
pub type SDL_DisplayEventID = ctypes::c_uint;
pub const SDL_ORIENTATION_UNKNOWN: SDL_DisplayOrientation = 0;
pub const SDL_ORIENTATION_LANDSCAPE: SDL_DisplayOrientation = 1;
pub const SDL_ORIENTATION_LANDSCAPE_FLIPPED: SDL_DisplayOrientation = 2;
pub const SDL_ORIENTATION_PORTRAIT: SDL_DisplayOrientation = 3;
pub const SDL_ORIENTATION_PORTRAIT_FLIPPED: SDL_DisplayOrientation = 4;
pub type SDL_DisplayOrientation = ctypes::c_uint;
pub const SDL_FLASH_CANCEL: SDL_FlashOperation = 0;
pub const SDL_FLASH_BRIEFLY: SDL_FlashOperation = 1;
pub const SDL_FLASH_UNTIL_FOCUSED: SDL_FlashOperation = 2;
pub type SDL_FlashOperation = ctypes::c_uint;
pub type SDL_GLContext = *mut ctypes::c_void;
pub const SDL_GL_RED_SIZE: SDL_GLattr = 0;
pub const SDL_GL_GREEN_SIZE: SDL_GLattr = 1;
pub const SDL_GL_BLUE_SIZE: SDL_GLattr = 2;
pub const SDL_GL_ALPHA_SIZE: SDL_GLattr = 3;
pub const SDL_GL_BUFFER_SIZE: SDL_GLattr = 4;
pub const SDL_GL_DOUBLEBUFFER: SDL_GLattr = 5;
pub const SDL_GL_DEPTH_SIZE: SDL_GLattr = 6;
pub const SDL_GL_STENCIL_SIZE: SDL_GLattr = 7;
pub const SDL_GL_ACCUM_RED_SIZE: SDL_GLattr = 8;
pub const SDL_GL_ACCUM_GREEN_SIZE: SDL_GLattr = 9;
pub const SDL_GL_ACCUM_BLUE_SIZE: SDL_GLattr = 10;
pub const SDL_GL_ACCUM_ALPHA_SIZE: SDL_GLattr = 11;
pub const SDL_GL_STEREO: SDL_GLattr = 12;
pub const SDL_GL_MULTISAMPLEBUFFERS: SDL_GLattr = 13;
pub const SDL_GL_MULTISAMPLESAMPLES: SDL_GLattr = 14;
pub const SDL_GL_ACCELERATED_VISUAL: SDL_GLattr = 15;
pub const SDL_GL_RETAINED_BACKING: SDL_GLattr = 16;
pub const SDL_GL_CONTEXT_MAJOR_VERSION: SDL_GLattr = 17;
pub const SDL_GL_CONTEXT_MINOR_VERSION: SDL_GLattr = 18;
pub const SDL_GL_CONTEXT_EGL: SDL_GLattr = 19;
pub const SDL_GL_CONTEXT_FLAGS: SDL_GLattr = 20;
pub const SDL_GL_CONTEXT_PROFILE_MASK: SDL_GLattr = 21;
pub const SDL_GL_SHARE_WITH_CURRENT_CONTEXT: SDL_GLattr = 22;
pub const SDL_GL_FRAMEBUFFER_SRGB_CAPABLE: SDL_GLattr = 23;
pub const SDL_GL_CONTEXT_RELEASE_BEHAVIOR: SDL_GLattr = 24;
pub const SDL_GL_CONTEXT_RESET_NOTIFICATION: SDL_GLattr = 25;
pub const SDL_GL_CONTEXT_NO_ERROR: SDL_GLattr = 26;
pub type SDL_GLattr = ctypes::c_uint;
pub const SDL_GL_CONTEXT_PROFILE_CORE: SDL_GLprofile = 1;
pub const SDL_GL_CONTEXT_PROFILE_COMPATIBILITY: SDL_GLprofile = 2;
pub const SDL_GL_CONTEXT_PROFILE_ES: SDL_GLprofile = 4;
pub type SDL_GLprofile = ctypes::c_uint;
pub const SDL_GL_CONTEXT_DEBUG_FLAG: SDL_GLcontextFlag = 1;
pub const SDL_GL_CONTEXT_FORWARD_COMPATIBLE_FLAG: SDL_GLcontextFlag = 2;
pub const SDL_GL_CONTEXT_ROBUST_ACCESS_FLAG: SDL_GLcontextFlag = 4;
pub const SDL_GL_CONTEXT_RESET_ISOLATION_FLAG: SDL_GLcontextFlag = 8;
pub type SDL_GLcontextFlag = ctypes::c_uint;
pub const SDL_GL_CONTEXT_RELEASE_BEHAVIOR_NONE: SDL_GLcontextReleaseFlag = 0;
pub const SDL_GL_CONTEXT_RELEASE_BEHAVIOR_FLUSH: SDL_GLcontextReleaseFlag = 1;
pub type SDL_GLcontextReleaseFlag = ctypes::c_uint;
pub const SDL_GL_CONTEXT_RESET_NO_NOTIFICATION: SDL_GLContextResetNotification = 0;
pub const SDL_GL_CONTEXT_RESET_LOSE_CONTEXT: SDL_GLContextResetNotification = 1;
pub type SDL_GLContextResetNotification = ctypes::c_uint;
extern "C" {
    pub fn SDL_GetNumVideoDrivers() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetVideoDriver(index: ctypes::c_int) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_VideoInit(driver_name: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_VideoQuit();
}
extern "C" {
    pub fn SDL_GetCurrentVideoDriver() -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_GetNumVideoDisplays() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetDisplayName(displayIndex: ctypes::c_int) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_GetDisplayBounds(displayIndex: ctypes::c_int, rect: *mut SDL_Rect) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetDisplayUsableBounds(
        displayIndex: ctypes::c_int,
        rect: *mut SDL_Rect,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetDisplayDPI(
        displayIndex: ctypes::c_int,
        ddpi: *mut f32,
        hdpi: *mut f32,
        vdpi: *mut f32,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetDisplayOrientation(displayIndex: ctypes::c_int) -> SDL_DisplayOrientation;
}
extern "C" {
    pub fn SDL_GetNumDisplayModes(displayIndex: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetDisplayMode(
        displayIndex: ctypes::c_int,
        modeIndex: ctypes::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetDesktopDisplayMode(
        displayIndex: ctypes::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetCurrentDisplayMode(
        displayIndex: ctypes::c_int,
        mode: *mut SDL_DisplayMode,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetClosestDisplayMode(
        displayIndex: ctypes::c_int,
        mode: *const SDL_DisplayMode,
        closest: *mut SDL_DisplayMode,
    ) -> *mut SDL_DisplayMode;
}
extern "C" {
    pub fn SDL_GetWindowDisplayIndex(window: *mut SDL_Window) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *const SDL_DisplayMode,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetWindowDisplayMode(
        window: *mut SDL_Window,
        mode: *mut SDL_DisplayMode,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetWindowPixelFormat(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    pub fn SDL_CreateWindow(
        title: *const ctypes::c_char,
        x: ctypes::c_int,
        y: ctypes::c_int,
        w: ctypes::c_int,
        h: ctypes::c_int,
        flags: Uint32,
    ) -> *mut SDL_Window;
}
extern "C" {
    pub fn SDL_CreateWindowFrom(data: *const ctypes::c_void) -> *mut SDL_Window;
}
extern "C" {
    pub fn SDL_GetWindowID(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    pub fn SDL_GetWindowFromID(id: Uint32) -> *mut SDL_Window;
}
extern "C" {
    pub fn SDL_GetWindowFlags(window: *mut SDL_Window) -> Uint32;
}
extern "C" {
    pub fn SDL_SetWindowTitle(window: *mut SDL_Window, title: *const ctypes::c_char);
}
extern "C" {
    pub fn SDL_GetWindowTitle(window: *mut SDL_Window) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_SetWindowIcon(window: *mut SDL_Window, icon: *mut SDL_Surface);
}
extern "C" {
    pub fn SDL_SetWindowData(
        window: *mut SDL_Window,
        name: *const ctypes::c_char,
        userdata: *mut ctypes::c_void,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_GetWindowData(
        window: *mut SDL_Window,
        name: *const ctypes::c_char,
    ) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_SetWindowPosition(window: *mut SDL_Window, x: ctypes::c_int, y: ctypes::c_int);
}
extern "C" {
    pub fn SDL_GetWindowPosition(
        window: *mut SDL_Window,
        x: *mut ctypes::c_int,
        y: *mut ctypes::c_int,
    );
}
extern "C" {
    pub fn SDL_SetWindowSize(window: *mut SDL_Window, w: ctypes::c_int, h: ctypes::c_int);
}
extern "C" {
    pub fn SDL_GetWindowSize(window: *mut SDL_Window, w: *mut ctypes::c_int, h: *mut ctypes::c_int);
}
extern "C" {
    pub fn SDL_GetWindowBordersSize(
        window: *mut SDL_Window,
        top: *mut ctypes::c_int,
        left: *mut ctypes::c_int,
        bottom: *mut ctypes::c_int,
        right: *mut ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetWindowMinimumSize(
        window: *mut SDL_Window,
        min_w: ctypes::c_int,
        min_h: ctypes::c_int,
    );
}
extern "C" {
    pub fn SDL_GetWindowMinimumSize(
        window: *mut SDL_Window,
        w: *mut ctypes::c_int,
        h: *mut ctypes::c_int,
    );
}
extern "C" {
    pub fn SDL_SetWindowMaximumSize(
        window: *mut SDL_Window,
        max_w: ctypes::c_int,
        max_h: ctypes::c_int,
    );
}
extern "C" {
    pub fn SDL_GetWindowMaximumSize(
        window: *mut SDL_Window,
        w: *mut ctypes::c_int,
        h: *mut ctypes::c_int,
    );
}
extern "C" {
    pub fn SDL_SetWindowBordered(window: *mut SDL_Window, bordered: SDL_bool);
}
extern "C" {
    pub fn SDL_SetWindowResizable(window: *mut SDL_Window, resizable: SDL_bool);
}
extern "C" {
    pub fn SDL_SetWindowAlwaysOnTop(window: *mut SDL_Window, on_top: SDL_bool);
}
extern "C" {
    pub fn SDL_ShowWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_HideWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_RaiseWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_MaximizeWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_MinimizeWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_RestoreWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_SetWindowFullscreen(window: *mut SDL_Window, flags: Uint32) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetWindowSurface(window: *mut SDL_Window) -> *mut SDL_Surface;
}
extern "C" {
    pub fn SDL_UpdateWindowSurface(window: *mut SDL_Window) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_UpdateWindowSurfaceRects(
        window: *mut SDL_Window,
        rects: *const SDL_Rect,
        numrects: ctypes::c_int,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetWindowGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
extern "C" {
    pub fn SDL_SetWindowKeyboardGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
extern "C" {
    pub fn SDL_SetWindowMouseGrab(window: *mut SDL_Window, grabbed: SDL_bool);
}
extern "C" {
    pub fn SDL_GetWindowGrab(window: *mut SDL_Window) -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetWindowKeyboardGrab(window: *mut SDL_Window) -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetWindowMouseGrab(window: *mut SDL_Window) -> SDL_bool;
}
extern "C" {
    pub fn SDL_GetGrabbedWindow() -> *mut SDL_Window;
}
extern "C" {
    pub fn SDL_SetWindowBrightness(window: *mut SDL_Window, brightness: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetWindowBrightness(window: *mut SDL_Window) -> f32;
}
extern "C" {
    pub fn SDL_SetWindowOpacity(window: *mut SDL_Window, opacity: f32) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetWindowOpacity(window: *mut SDL_Window, out_opacity: *mut f32) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetWindowModalFor(
        modal_window: *mut SDL_Window,
        parent_window: *mut SDL_Window,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetWindowInputFocus(window: *mut SDL_Window) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *const Uint16,
        green: *const Uint16,
        blue: *const Uint16,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetWindowGammaRamp(
        window: *mut SDL_Window,
        red: *mut Uint16,
        green: *mut Uint16,
        blue: *mut Uint16,
    ) -> ctypes::c_int;
}
pub const SDL_HITTEST_NORMAL: SDL_HitTestResult = 0;
pub const SDL_HITTEST_DRAGGABLE: SDL_HitTestResult = 1;
pub const SDL_HITTEST_RESIZE_TOPLEFT: SDL_HitTestResult = 2;
pub const SDL_HITTEST_RESIZE_TOP: SDL_HitTestResult = 3;
pub const SDL_HITTEST_RESIZE_TOPRIGHT: SDL_HitTestResult = 4;
pub const SDL_HITTEST_RESIZE_RIGHT: SDL_HitTestResult = 5;
pub const SDL_HITTEST_RESIZE_BOTTOMRIGHT: SDL_HitTestResult = 6;
pub const SDL_HITTEST_RESIZE_BOTTOM: SDL_HitTestResult = 7;
pub const SDL_HITTEST_RESIZE_BOTTOMLEFT: SDL_HitTestResult = 8;
pub const SDL_HITTEST_RESIZE_LEFT: SDL_HitTestResult = 9;
pub type SDL_HitTestResult = ctypes::c_uint;
pub type SDL_HitTest = ::core::option::Option<
    unsafe extern "C" fn(
        win: *mut SDL_Window,
        area: *const SDL_Point,
        data: *mut ctypes::c_void,
    ) -> SDL_HitTestResult,
>;
extern "C" {
    pub fn SDL_SetWindowHitTest(
        window: *mut SDL_Window,
        callback: SDL_HitTest,
        callback_data: *mut ctypes::c_void,
    ) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_FlashWindow(window: *mut SDL_Window, operation: SDL_FlashOperation)
        -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_DestroyWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_IsScreenSaverEnabled() -> SDL_bool;
}
extern "C" {
    pub fn SDL_EnableScreenSaver();
}
extern "C" {
    pub fn SDL_DisableScreenSaver();
}
extern "C" {
    pub fn SDL_GL_LoadLibrary(path: *const ctypes::c_char) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GL_GetProcAddress(proc_: *const ctypes::c_char) -> *mut ctypes::c_void;
}
extern "C" {
    pub fn SDL_GL_UnloadLibrary();
}
extern "C" {
    pub fn SDL_GL_ExtensionSupported(extension: *const ctypes::c_char) -> SDL_bool;
}
extern "C" {
    pub fn SDL_GL_ResetAttributes();
}
extern "C" {
    pub fn SDL_GL_SetAttribute(attr: SDL_GLattr, value: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GL_GetAttribute(attr: SDL_GLattr, value: *mut ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GL_CreateContext(window: *mut SDL_Window) -> SDL_GLContext;
}
extern "C" {
    pub fn SDL_GL_MakeCurrent(window: *mut SDL_Window, context: SDL_GLContext) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GL_GetCurrentWindow() -> *mut SDL_Window;
}
extern "C" {
    pub fn SDL_GL_GetCurrentContext() -> SDL_GLContext;
}
extern "C" {
    pub fn SDL_GL_GetDrawableSize(
        window: *mut SDL_Window,
        w: *mut ctypes::c_int,
        h: *mut ctypes::c_int,
    );
}
extern "C" {
    pub fn SDL_GL_SetSwapInterval(interval: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GL_GetSwapInterval() -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GL_SwapWindow(window: *mut SDL_Window);
}
extern "C" {
    pub fn SDL_GL_DeleteContext(context: SDL_GLContext);
}
pub const SDL_SCANCODE_UNKNOWN: SDL_Scancode = 0;
pub const SDL_SCANCODE_A: SDL_Scancode = 4;
pub const SDL_SCANCODE_B: SDL_Scancode = 5;
pub const SDL_SCANCODE_C: SDL_Scancode = 6;
pub const SDL_SCANCODE_D: SDL_Scancode = 7;
pub const SDL_SCANCODE_E: SDL_Scancode = 8;
pub const SDL_SCANCODE_F: SDL_Scancode = 9;
pub const SDL_SCANCODE_G: SDL_Scancode = 10;
pub const SDL_SCANCODE_H: SDL_Scancode = 11;
pub const SDL_SCANCODE_I: SDL_Scancode = 12;
pub const SDL_SCANCODE_J: SDL_Scancode = 13;
pub const SDL_SCANCODE_K: SDL_Scancode = 14;
pub const SDL_SCANCODE_L: SDL_Scancode = 15;
pub const SDL_SCANCODE_M: SDL_Scancode = 16;
pub const SDL_SCANCODE_N: SDL_Scancode = 17;
pub const SDL_SCANCODE_O: SDL_Scancode = 18;
pub const SDL_SCANCODE_P: SDL_Scancode = 19;
pub const SDL_SCANCODE_Q: SDL_Scancode = 20;
pub const SDL_SCANCODE_R: SDL_Scancode = 21;
pub const SDL_SCANCODE_S: SDL_Scancode = 22;
pub const SDL_SCANCODE_T: SDL_Scancode = 23;
pub const SDL_SCANCODE_U: SDL_Scancode = 24;
pub const SDL_SCANCODE_V: SDL_Scancode = 25;
pub const SDL_SCANCODE_W: SDL_Scancode = 26;
pub const SDL_SCANCODE_X: SDL_Scancode = 27;
pub const SDL_SCANCODE_Y: SDL_Scancode = 28;
pub const SDL_SCANCODE_Z: SDL_Scancode = 29;
pub const SDL_SCANCODE_1: SDL_Scancode = 30;
pub const SDL_SCANCODE_2: SDL_Scancode = 31;
pub const SDL_SCANCODE_3: SDL_Scancode = 32;
pub const SDL_SCANCODE_4: SDL_Scancode = 33;
pub const SDL_SCANCODE_5: SDL_Scancode = 34;
pub const SDL_SCANCODE_6: SDL_Scancode = 35;
pub const SDL_SCANCODE_7: SDL_Scancode = 36;
pub const SDL_SCANCODE_8: SDL_Scancode = 37;
pub const SDL_SCANCODE_9: SDL_Scancode = 38;
pub const SDL_SCANCODE_0: SDL_Scancode = 39;
pub const SDL_SCANCODE_RETURN: SDL_Scancode = 40;
pub const SDL_SCANCODE_ESCAPE: SDL_Scancode = 41;
pub const SDL_SCANCODE_BACKSPACE: SDL_Scancode = 42;
pub const SDL_SCANCODE_TAB: SDL_Scancode = 43;
pub const SDL_SCANCODE_SPACE: SDL_Scancode = 44;
pub const SDL_SCANCODE_MINUS: SDL_Scancode = 45;
pub const SDL_SCANCODE_EQUALS: SDL_Scancode = 46;
pub const SDL_SCANCODE_LEFTBRACKET: SDL_Scancode = 47;
pub const SDL_SCANCODE_RIGHTBRACKET: SDL_Scancode = 48;
pub const SDL_SCANCODE_BACKSLASH: SDL_Scancode = 49;
pub const SDL_SCANCODE_NONUSHASH: SDL_Scancode = 50;
pub const SDL_SCANCODE_SEMICOLON: SDL_Scancode = 51;
pub const SDL_SCANCODE_APOSTROPHE: SDL_Scancode = 52;
pub const SDL_SCANCODE_GRAVE: SDL_Scancode = 53;
pub const SDL_SCANCODE_COMMA: SDL_Scancode = 54;
pub const SDL_SCANCODE_PERIOD: SDL_Scancode = 55;
pub const SDL_SCANCODE_SLASH: SDL_Scancode = 56;
pub const SDL_SCANCODE_CAPSLOCK: SDL_Scancode = 57;
pub const SDL_SCANCODE_F1: SDL_Scancode = 58;
pub const SDL_SCANCODE_F2: SDL_Scancode = 59;
pub const SDL_SCANCODE_F3: SDL_Scancode = 60;
pub const SDL_SCANCODE_F4: SDL_Scancode = 61;
pub const SDL_SCANCODE_F5: SDL_Scancode = 62;
pub const SDL_SCANCODE_F6: SDL_Scancode = 63;
pub const SDL_SCANCODE_F7: SDL_Scancode = 64;
pub const SDL_SCANCODE_F8: SDL_Scancode = 65;
pub const SDL_SCANCODE_F9: SDL_Scancode = 66;
pub const SDL_SCANCODE_F10: SDL_Scancode = 67;
pub const SDL_SCANCODE_F11: SDL_Scancode = 68;
pub const SDL_SCANCODE_F12: SDL_Scancode = 69;
pub const SDL_SCANCODE_PRINTSCREEN: SDL_Scancode = 70;
pub const SDL_SCANCODE_SCROLLLOCK: SDL_Scancode = 71;
pub const SDL_SCANCODE_PAUSE: SDL_Scancode = 72;
pub const SDL_SCANCODE_INSERT: SDL_Scancode = 73;
pub const SDL_SCANCODE_HOME: SDL_Scancode = 74;
pub const SDL_SCANCODE_PAGEUP: SDL_Scancode = 75;
pub const SDL_SCANCODE_DELETE: SDL_Scancode = 76;
pub const SDL_SCANCODE_END: SDL_Scancode = 77;
pub const SDL_SCANCODE_PAGEDOWN: SDL_Scancode = 78;
pub const SDL_SCANCODE_RIGHT: SDL_Scancode = 79;
pub const SDL_SCANCODE_LEFT: SDL_Scancode = 80;
pub const SDL_SCANCODE_DOWN: SDL_Scancode = 81;
pub const SDL_SCANCODE_UP: SDL_Scancode = 82;
pub const SDL_SCANCODE_NUMLOCKCLEAR: SDL_Scancode = 83;
pub const SDL_SCANCODE_KP_DIVIDE: SDL_Scancode = 84;
pub const SDL_SCANCODE_KP_MULTIPLY: SDL_Scancode = 85;
pub const SDL_SCANCODE_KP_MINUS: SDL_Scancode = 86;
pub const SDL_SCANCODE_KP_PLUS: SDL_Scancode = 87;
pub const SDL_SCANCODE_KP_ENTER: SDL_Scancode = 88;
pub const SDL_SCANCODE_KP_1: SDL_Scancode = 89;
pub const SDL_SCANCODE_KP_2: SDL_Scancode = 90;
pub const SDL_SCANCODE_KP_3: SDL_Scancode = 91;
pub const SDL_SCANCODE_KP_4: SDL_Scancode = 92;
pub const SDL_SCANCODE_KP_5: SDL_Scancode = 93;
pub const SDL_SCANCODE_KP_6: SDL_Scancode = 94;
pub const SDL_SCANCODE_KP_7: SDL_Scancode = 95;
pub const SDL_SCANCODE_KP_8: SDL_Scancode = 96;
pub const SDL_SCANCODE_KP_9: SDL_Scancode = 97;
pub const SDL_SCANCODE_KP_0: SDL_Scancode = 98;
pub const SDL_SCANCODE_KP_PERIOD: SDL_Scancode = 99;
pub const SDL_SCANCODE_NONUSBACKSLASH: SDL_Scancode = 100;
pub const SDL_SCANCODE_APPLICATION: SDL_Scancode = 101;
pub const SDL_SCANCODE_POWER: SDL_Scancode = 102;
pub const SDL_SCANCODE_KP_EQUALS: SDL_Scancode = 103;
pub const SDL_SCANCODE_F13: SDL_Scancode = 104;
pub const SDL_SCANCODE_F14: SDL_Scancode = 105;
pub const SDL_SCANCODE_F15: SDL_Scancode = 106;
pub const SDL_SCANCODE_F16: SDL_Scancode = 107;
pub const SDL_SCANCODE_F17: SDL_Scancode = 108;
pub const SDL_SCANCODE_F18: SDL_Scancode = 109;
pub const SDL_SCANCODE_F19: SDL_Scancode = 110;
pub const SDL_SCANCODE_F20: SDL_Scancode = 111;
pub const SDL_SCANCODE_F21: SDL_Scancode = 112;
pub const SDL_SCANCODE_F22: SDL_Scancode = 113;
pub const SDL_SCANCODE_F23: SDL_Scancode = 114;
pub const SDL_SCANCODE_F24: SDL_Scancode = 115;
pub const SDL_SCANCODE_EXECUTE: SDL_Scancode = 116;
pub const SDL_SCANCODE_HELP: SDL_Scancode = 117;
pub const SDL_SCANCODE_MENU: SDL_Scancode = 118;
pub const SDL_SCANCODE_SELECT: SDL_Scancode = 119;
pub const SDL_SCANCODE_STOP: SDL_Scancode = 120;
pub const SDL_SCANCODE_AGAIN: SDL_Scancode = 121;
pub const SDL_SCANCODE_UNDO: SDL_Scancode = 122;
pub const SDL_SCANCODE_CUT: SDL_Scancode = 123;
pub const SDL_SCANCODE_COPY: SDL_Scancode = 124;
pub const SDL_SCANCODE_PASTE: SDL_Scancode = 125;
pub const SDL_SCANCODE_FIND: SDL_Scancode = 126;
pub const SDL_SCANCODE_MUTE: SDL_Scancode = 127;
pub const SDL_SCANCODE_VOLUMEUP: SDL_Scancode = 128;
pub const SDL_SCANCODE_VOLUMEDOWN: SDL_Scancode = 129;
pub const SDL_SCANCODE_KP_COMMA: SDL_Scancode = 133;
pub const SDL_SCANCODE_KP_EQUALSAS400: SDL_Scancode = 134;
pub const SDL_SCANCODE_INTERNATIONAL1: SDL_Scancode = 135;
pub const SDL_SCANCODE_INTERNATIONAL2: SDL_Scancode = 136;
pub const SDL_SCANCODE_INTERNATIONAL3: SDL_Scancode = 137;
pub const SDL_SCANCODE_INTERNATIONAL4: SDL_Scancode = 138;
pub const SDL_SCANCODE_INTERNATIONAL5: SDL_Scancode = 139;
pub const SDL_SCANCODE_INTERNATIONAL6: SDL_Scancode = 140;
pub const SDL_SCANCODE_INTERNATIONAL7: SDL_Scancode = 141;
pub const SDL_SCANCODE_INTERNATIONAL8: SDL_Scancode = 142;
pub const SDL_SCANCODE_INTERNATIONAL9: SDL_Scancode = 143;
pub const SDL_SCANCODE_LANG1: SDL_Scancode = 144;
pub const SDL_SCANCODE_LANG2: SDL_Scancode = 145;
pub const SDL_SCANCODE_LANG3: SDL_Scancode = 146;
pub const SDL_SCANCODE_LANG4: SDL_Scancode = 147;
pub const SDL_SCANCODE_LANG5: SDL_Scancode = 148;
pub const SDL_SCANCODE_LANG6: SDL_Scancode = 149;
pub const SDL_SCANCODE_LANG7: SDL_Scancode = 150;
pub const SDL_SCANCODE_LANG8: SDL_Scancode = 151;
pub const SDL_SCANCODE_LANG9: SDL_Scancode = 152;
pub const SDL_SCANCODE_ALTERASE: SDL_Scancode = 153;
pub const SDL_SCANCODE_SYSREQ: SDL_Scancode = 154;
pub const SDL_SCANCODE_CANCEL: SDL_Scancode = 155;
pub const SDL_SCANCODE_CLEAR: SDL_Scancode = 156;
pub const SDL_SCANCODE_PRIOR: SDL_Scancode = 157;
pub const SDL_SCANCODE_RETURN2: SDL_Scancode = 158;
pub const SDL_SCANCODE_SEPARATOR: SDL_Scancode = 159;
pub const SDL_SCANCODE_OUT: SDL_Scancode = 160;
pub const SDL_SCANCODE_OPER: SDL_Scancode = 161;
pub const SDL_SCANCODE_CLEARAGAIN: SDL_Scancode = 162;
pub const SDL_SCANCODE_CRSEL: SDL_Scancode = 163;
pub const SDL_SCANCODE_EXSEL: SDL_Scancode = 164;
pub const SDL_SCANCODE_KP_00: SDL_Scancode = 176;
pub const SDL_SCANCODE_KP_000: SDL_Scancode = 177;
pub const SDL_SCANCODE_THOUSANDSSEPARATOR: SDL_Scancode = 178;
pub const SDL_SCANCODE_DECIMALSEPARATOR: SDL_Scancode = 179;
pub const SDL_SCANCODE_CURRENCYUNIT: SDL_Scancode = 180;
pub const SDL_SCANCODE_CURRENCYSUBUNIT: SDL_Scancode = 181;
pub const SDL_SCANCODE_KP_LEFTPAREN: SDL_Scancode = 182;
pub const SDL_SCANCODE_KP_RIGHTPAREN: SDL_Scancode = 183;
pub const SDL_SCANCODE_KP_LEFTBRACE: SDL_Scancode = 184;
pub const SDL_SCANCODE_KP_RIGHTBRACE: SDL_Scancode = 185;
pub const SDL_SCANCODE_KP_TAB: SDL_Scancode = 186;
pub const SDL_SCANCODE_KP_BACKSPACE: SDL_Scancode = 187;
pub const SDL_SCANCODE_KP_A: SDL_Scancode = 188;
pub const SDL_SCANCODE_KP_B: SDL_Scancode = 189;
pub const SDL_SCANCODE_KP_C: SDL_Scancode = 190;
pub const SDL_SCANCODE_KP_D: SDL_Scancode = 191;
pub const SDL_SCANCODE_KP_E: SDL_Scancode = 192;
pub const SDL_SCANCODE_KP_F: SDL_Scancode = 193;
pub const SDL_SCANCODE_KP_XOR: SDL_Scancode = 194;
pub const SDL_SCANCODE_KP_POWER: SDL_Scancode = 195;
pub const SDL_SCANCODE_KP_PERCENT: SDL_Scancode = 196;
pub const SDL_SCANCODE_KP_LESS: SDL_Scancode = 197;
pub const SDL_SCANCODE_KP_GREATER: SDL_Scancode = 198;
pub const SDL_SCANCODE_KP_AMPERSAND: SDL_Scancode = 199;
pub const SDL_SCANCODE_KP_DBLAMPERSAND: SDL_Scancode = 200;
pub const SDL_SCANCODE_KP_VERTICALBAR: SDL_Scancode = 201;
pub const SDL_SCANCODE_KP_DBLVERTICALBAR: SDL_Scancode = 202;
pub const SDL_SCANCODE_KP_COLON: SDL_Scancode = 203;
pub const SDL_SCANCODE_KP_HASH: SDL_Scancode = 204;
pub const SDL_SCANCODE_KP_SPACE: SDL_Scancode = 205;
pub const SDL_SCANCODE_KP_AT: SDL_Scancode = 206;
pub const SDL_SCANCODE_KP_EXCLAM: SDL_Scancode = 207;
pub const SDL_SCANCODE_KP_MEMSTORE: SDL_Scancode = 208;
pub const SDL_SCANCODE_KP_MEMRECALL: SDL_Scancode = 209;
pub const SDL_SCANCODE_KP_MEMCLEAR: SDL_Scancode = 210;
pub const SDL_SCANCODE_KP_MEMADD: SDL_Scancode = 211;
pub const SDL_SCANCODE_KP_MEMSUBTRACT: SDL_Scancode = 212;
pub const SDL_SCANCODE_KP_MEMMULTIPLY: SDL_Scancode = 213;
pub const SDL_SCANCODE_KP_MEMDIVIDE: SDL_Scancode = 214;
pub const SDL_SCANCODE_KP_PLUSMINUS: SDL_Scancode = 215;
pub const SDL_SCANCODE_KP_CLEAR: SDL_Scancode = 216;
pub const SDL_SCANCODE_KP_CLEARENTRY: SDL_Scancode = 217;
pub const SDL_SCANCODE_KP_BINARY: SDL_Scancode = 218;
pub const SDL_SCANCODE_KP_OCTAL: SDL_Scancode = 219;
pub const SDL_SCANCODE_KP_DECIMAL: SDL_Scancode = 220;
pub const SDL_SCANCODE_KP_HEXADECIMAL: SDL_Scancode = 221;
pub const SDL_SCANCODE_LCTRL: SDL_Scancode = 224;
pub const SDL_SCANCODE_LSHIFT: SDL_Scancode = 225;
pub const SDL_SCANCODE_LALT: SDL_Scancode = 226;
pub const SDL_SCANCODE_LGUI: SDL_Scancode = 227;
pub const SDL_SCANCODE_RCTRL: SDL_Scancode = 228;
pub const SDL_SCANCODE_RSHIFT: SDL_Scancode = 229;
pub const SDL_SCANCODE_RALT: SDL_Scancode = 230;
pub const SDL_SCANCODE_RGUI: SDL_Scancode = 231;
pub const SDL_SCANCODE_MODE: SDL_Scancode = 257;
pub const SDL_SCANCODE_AUDIONEXT: SDL_Scancode = 258;
pub const SDL_SCANCODE_AUDIOPREV: SDL_Scancode = 259;
pub const SDL_SCANCODE_AUDIOSTOP: SDL_Scancode = 260;
pub const SDL_SCANCODE_AUDIOPLAY: SDL_Scancode = 261;
pub const SDL_SCANCODE_AUDIOMUTE: SDL_Scancode = 262;
pub const SDL_SCANCODE_MEDIASELECT: SDL_Scancode = 263;
pub const SDL_SCANCODE_WWW: SDL_Scancode = 264;
pub const SDL_SCANCODE_MAIL: SDL_Scancode = 265;
pub const SDL_SCANCODE_CALCULATOR: SDL_Scancode = 266;
pub const SDL_SCANCODE_COMPUTER: SDL_Scancode = 267;
pub const SDL_SCANCODE_AC_SEARCH: SDL_Scancode = 268;
pub const SDL_SCANCODE_AC_HOME: SDL_Scancode = 269;
pub const SDL_SCANCODE_AC_BACK: SDL_Scancode = 270;
pub const SDL_SCANCODE_AC_FORWARD: SDL_Scancode = 271;
pub const SDL_SCANCODE_AC_STOP: SDL_Scancode = 272;
pub const SDL_SCANCODE_AC_REFRESH: SDL_Scancode = 273;
pub const SDL_SCANCODE_AC_BOOKMARKS: SDL_Scancode = 274;
pub const SDL_SCANCODE_BRIGHTNESSDOWN: SDL_Scancode = 275;
pub const SDL_SCANCODE_BRIGHTNESSUP: SDL_Scancode = 276;
pub const SDL_SCANCODE_DISPLAYSWITCH: SDL_Scancode = 277;
pub const SDL_SCANCODE_KBDILLUMTOGGLE: SDL_Scancode = 278;
pub const SDL_SCANCODE_KBDILLUMDOWN: SDL_Scancode = 279;
pub const SDL_SCANCODE_KBDILLUMUP: SDL_Scancode = 280;
pub const SDL_SCANCODE_EJECT: SDL_Scancode = 281;
pub const SDL_SCANCODE_SLEEP: SDL_Scancode = 282;
pub const SDL_SCANCODE_APP1: SDL_Scancode = 283;
pub const SDL_SCANCODE_APP2: SDL_Scancode = 284;
pub const SDL_SCANCODE_AUDIOREWIND: SDL_Scancode = 285;
pub const SDL_SCANCODE_AUDIOFASTFORWARD: SDL_Scancode = 286;
pub const SDL_NUM_SCANCODES: SDL_Scancode = 512;
pub type SDL_Scancode = ctypes::c_uint;
pub type SDL_Keycode = Sint32;
pub const SDLK_UNKNOWN: SDL_KeyCode = 0;
pub const SDLK_RETURN: SDL_KeyCode = 13;
pub const SDLK_ESCAPE: SDL_KeyCode = 27;
pub const SDLK_BACKSPACE: SDL_KeyCode = 8;
pub const SDLK_TAB: SDL_KeyCode = 9;
pub const SDLK_SPACE: SDL_KeyCode = 32;
pub const SDLK_EXCLAIM: SDL_KeyCode = 33;
pub const SDLK_QUOTEDBL: SDL_KeyCode = 34;
pub const SDLK_HASH: SDL_KeyCode = 35;
pub const SDLK_PERCENT: SDL_KeyCode = 37;
pub const SDLK_DOLLAR: SDL_KeyCode = 36;
pub const SDLK_AMPERSAND: SDL_KeyCode = 38;
pub const SDLK_QUOTE: SDL_KeyCode = 39;
pub const SDLK_LEFTPAREN: SDL_KeyCode = 40;
pub const SDLK_RIGHTPAREN: SDL_KeyCode = 41;
pub const SDLK_ASTERISK: SDL_KeyCode = 42;
pub const SDLK_PLUS: SDL_KeyCode = 43;
pub const SDLK_COMMA: SDL_KeyCode = 44;
pub const SDLK_MINUS: SDL_KeyCode = 45;
pub const SDLK_PERIOD: SDL_KeyCode = 46;
pub const SDLK_SLASH: SDL_KeyCode = 47;
pub const SDLK_0: SDL_KeyCode = 48;
pub const SDLK_1: SDL_KeyCode = 49;
pub const SDLK_2: SDL_KeyCode = 50;
pub const SDLK_3: SDL_KeyCode = 51;
pub const SDLK_4: SDL_KeyCode = 52;
pub const SDLK_5: SDL_KeyCode = 53;
pub const SDLK_6: SDL_KeyCode = 54;
pub const SDLK_7: SDL_KeyCode = 55;
pub const SDLK_8: SDL_KeyCode = 56;
pub const SDLK_9: SDL_KeyCode = 57;
pub const SDLK_COLON: SDL_KeyCode = 58;
pub const SDLK_SEMICOLON: SDL_KeyCode = 59;
pub const SDLK_LESS: SDL_KeyCode = 60;
pub const SDLK_EQUALS: SDL_KeyCode = 61;
pub const SDLK_GREATER: SDL_KeyCode = 62;
pub const SDLK_QUESTION: SDL_KeyCode = 63;
pub const SDLK_AT: SDL_KeyCode = 64;
pub const SDLK_LEFTBRACKET: SDL_KeyCode = 91;
pub const SDLK_BACKSLASH: SDL_KeyCode = 92;
pub const SDLK_RIGHTBRACKET: SDL_KeyCode = 93;
pub const SDLK_CARET: SDL_KeyCode = 94;
pub const SDLK_UNDERSCORE: SDL_KeyCode = 95;
pub const SDLK_BACKQUOTE: SDL_KeyCode = 96;
pub const SDLK_a: SDL_KeyCode = 97;
pub const SDLK_b: SDL_KeyCode = 98;
pub const SDLK_c: SDL_KeyCode = 99;
pub const SDLK_d: SDL_KeyCode = 100;
pub const SDLK_e: SDL_KeyCode = 101;
pub const SDLK_f: SDL_KeyCode = 102;
pub const SDLK_g: SDL_KeyCode = 103;
pub const SDLK_h: SDL_KeyCode = 104;
pub const SDLK_i: SDL_KeyCode = 105;
pub const SDLK_j: SDL_KeyCode = 106;
pub const SDLK_k: SDL_KeyCode = 107;
pub const SDLK_l: SDL_KeyCode = 108;
pub const SDLK_m: SDL_KeyCode = 109;
pub const SDLK_n: SDL_KeyCode = 110;
pub const SDLK_o: SDL_KeyCode = 111;
pub const SDLK_p: SDL_KeyCode = 112;
pub const SDLK_q: SDL_KeyCode = 113;
pub const SDLK_r: SDL_KeyCode = 114;
pub const SDLK_s: SDL_KeyCode = 115;
pub const SDLK_t: SDL_KeyCode = 116;
pub const SDLK_u: SDL_KeyCode = 117;
pub const SDLK_v: SDL_KeyCode = 118;
pub const SDLK_w: SDL_KeyCode = 119;
pub const SDLK_x: SDL_KeyCode = 120;
pub const SDLK_y: SDL_KeyCode = 121;
pub const SDLK_z: SDL_KeyCode = 122;
pub const SDLK_CAPSLOCK: SDL_KeyCode = 1073741881;
pub const SDLK_F1: SDL_KeyCode = 1073741882;
pub const SDLK_F2: SDL_KeyCode = 1073741883;
pub const SDLK_F3: SDL_KeyCode = 1073741884;
pub const SDLK_F4: SDL_KeyCode = 1073741885;
pub const SDLK_F5: SDL_KeyCode = 1073741886;
pub const SDLK_F6: SDL_KeyCode = 1073741887;
pub const SDLK_F7: SDL_KeyCode = 1073741888;
pub const SDLK_F8: SDL_KeyCode = 1073741889;
pub const SDLK_F9: SDL_KeyCode = 1073741890;
pub const SDLK_F10: SDL_KeyCode = 1073741891;
pub const SDLK_F11: SDL_KeyCode = 1073741892;
pub const SDLK_F12: SDL_KeyCode = 1073741893;
pub const SDLK_PRINTSCREEN: SDL_KeyCode = 1073741894;
pub const SDLK_SCROLLLOCK: SDL_KeyCode = 1073741895;
pub const SDLK_PAUSE: SDL_KeyCode = 1073741896;
pub const SDLK_INSERT: SDL_KeyCode = 1073741897;
pub const SDLK_HOME: SDL_KeyCode = 1073741898;
pub const SDLK_PAGEUP: SDL_KeyCode = 1073741899;
pub const SDLK_DELETE: SDL_KeyCode = 127;
pub const SDLK_END: SDL_KeyCode = 1073741901;
pub const SDLK_PAGEDOWN: SDL_KeyCode = 1073741902;
pub const SDLK_RIGHT: SDL_KeyCode = 1073741903;
pub const SDLK_LEFT: SDL_KeyCode = 1073741904;
pub const SDLK_DOWN: SDL_KeyCode = 1073741905;
pub const SDLK_UP: SDL_KeyCode = 1073741906;
pub const SDLK_NUMLOCKCLEAR: SDL_KeyCode = 1073741907;
pub const SDLK_KP_DIVIDE: SDL_KeyCode = 1073741908;
pub const SDLK_KP_MULTIPLY: SDL_KeyCode = 1073741909;
pub const SDLK_KP_MINUS: SDL_KeyCode = 1073741910;
pub const SDLK_KP_PLUS: SDL_KeyCode = 1073741911;
pub const SDLK_KP_ENTER: SDL_KeyCode = 1073741912;
pub const SDLK_KP_1: SDL_KeyCode = 1073741913;
pub const SDLK_KP_2: SDL_KeyCode = 1073741914;
pub const SDLK_KP_3: SDL_KeyCode = 1073741915;
pub const SDLK_KP_4: SDL_KeyCode = 1073741916;
pub const SDLK_KP_5: SDL_KeyCode = 1073741917;
pub const SDLK_KP_6: SDL_KeyCode = 1073741918;
pub const SDLK_KP_7: SDL_KeyCode = 1073741919;
pub const SDLK_KP_8: SDL_KeyCode = 1073741920;
pub const SDLK_KP_9: SDL_KeyCode = 1073741921;
pub const SDLK_KP_0: SDL_KeyCode = 1073741922;
pub const SDLK_KP_PERIOD: SDL_KeyCode = 1073741923;
pub const SDLK_APPLICATION: SDL_KeyCode = 1073741925;
pub const SDLK_POWER: SDL_KeyCode = 1073741926;
pub const SDLK_KP_EQUALS: SDL_KeyCode = 1073741927;
pub const SDLK_F13: SDL_KeyCode = 1073741928;
pub const SDLK_F14: SDL_KeyCode = 1073741929;
pub const SDLK_F15: SDL_KeyCode = 1073741930;
pub const SDLK_F16: SDL_KeyCode = 1073741931;
pub const SDLK_F17: SDL_KeyCode = 1073741932;
pub const SDLK_F18: SDL_KeyCode = 1073741933;
pub const SDLK_F19: SDL_KeyCode = 1073741934;
pub const SDLK_F20: SDL_KeyCode = 1073741935;
pub const SDLK_F21: SDL_KeyCode = 1073741936;
pub const SDLK_F22: SDL_KeyCode = 1073741937;
pub const SDLK_F23: SDL_KeyCode = 1073741938;
pub const SDLK_F24: SDL_KeyCode = 1073741939;
pub const SDLK_EXECUTE: SDL_KeyCode = 1073741940;
pub const SDLK_HELP: SDL_KeyCode = 1073741941;
pub const SDLK_MENU: SDL_KeyCode = 1073741942;
pub const SDLK_SELECT: SDL_KeyCode = 1073741943;
pub const SDLK_STOP: SDL_KeyCode = 1073741944;
pub const SDLK_AGAIN: SDL_KeyCode = 1073741945;
pub const SDLK_UNDO: SDL_KeyCode = 1073741946;
pub const SDLK_CUT: SDL_KeyCode = 1073741947;
pub const SDLK_COPY: SDL_KeyCode = 1073741948;
pub const SDLK_PASTE: SDL_KeyCode = 1073741949;
pub const SDLK_FIND: SDL_KeyCode = 1073741950;
pub const SDLK_MUTE: SDL_KeyCode = 1073741951;
pub const SDLK_VOLUMEUP: SDL_KeyCode = 1073741952;
pub const SDLK_VOLUMEDOWN: SDL_KeyCode = 1073741953;
pub const SDLK_KP_COMMA: SDL_KeyCode = 1073741957;
pub const SDLK_KP_EQUALSAS400: SDL_KeyCode = 1073741958;
pub const SDLK_ALTERASE: SDL_KeyCode = 1073741977;
pub const SDLK_SYSREQ: SDL_KeyCode = 1073741978;
pub const SDLK_CANCEL: SDL_KeyCode = 1073741979;
pub const SDLK_CLEAR: SDL_KeyCode = 1073741980;
pub const SDLK_PRIOR: SDL_KeyCode = 1073741981;
pub const SDLK_RETURN2: SDL_KeyCode = 1073741982;
pub const SDLK_SEPARATOR: SDL_KeyCode = 1073741983;
pub const SDLK_OUT: SDL_KeyCode = 1073741984;
pub const SDLK_OPER: SDL_KeyCode = 1073741985;
pub const SDLK_CLEARAGAIN: SDL_KeyCode = 1073741986;
pub const SDLK_CRSEL: SDL_KeyCode = 1073741987;
pub const SDLK_EXSEL: SDL_KeyCode = 1073741988;
pub const SDLK_KP_00: SDL_KeyCode = 1073742000;
pub const SDLK_KP_000: SDL_KeyCode = 1073742001;
pub const SDLK_THOUSANDSSEPARATOR: SDL_KeyCode = 1073742002;
pub const SDLK_DECIMALSEPARATOR: SDL_KeyCode = 1073742003;
pub const SDLK_CURRENCYUNIT: SDL_KeyCode = 1073742004;
pub const SDLK_CURRENCYSUBUNIT: SDL_KeyCode = 1073742005;
pub const SDLK_KP_LEFTPAREN: SDL_KeyCode = 1073742006;
pub const SDLK_KP_RIGHTPAREN: SDL_KeyCode = 1073742007;
pub const SDLK_KP_LEFTBRACE: SDL_KeyCode = 1073742008;
pub const SDLK_KP_RIGHTBRACE: SDL_KeyCode = 1073742009;
pub const SDLK_KP_TAB: SDL_KeyCode = 1073742010;
pub const SDLK_KP_BACKSPACE: SDL_KeyCode = 1073742011;
pub const SDLK_KP_A: SDL_KeyCode = 1073742012;
pub const SDLK_KP_B: SDL_KeyCode = 1073742013;
pub const SDLK_KP_C: SDL_KeyCode = 1073742014;
pub const SDLK_KP_D: SDL_KeyCode = 1073742015;
pub const SDLK_KP_E: SDL_KeyCode = 1073742016;
pub const SDLK_KP_F: SDL_KeyCode = 1073742017;
pub const SDLK_KP_XOR: SDL_KeyCode = 1073742018;
pub const SDLK_KP_POWER: SDL_KeyCode = 1073742019;
pub const SDLK_KP_PERCENT: SDL_KeyCode = 1073742020;
pub const SDLK_KP_LESS: SDL_KeyCode = 1073742021;
pub const SDLK_KP_GREATER: SDL_KeyCode = 1073742022;
pub const SDLK_KP_AMPERSAND: SDL_KeyCode = 1073742023;
pub const SDLK_KP_DBLAMPERSAND: SDL_KeyCode = 1073742024;
pub const SDLK_KP_VERTICALBAR: SDL_KeyCode = 1073742025;
pub const SDLK_KP_DBLVERTICALBAR: SDL_KeyCode = 1073742026;
pub const SDLK_KP_COLON: SDL_KeyCode = 1073742027;
pub const SDLK_KP_HASH: SDL_KeyCode = 1073742028;
pub const SDLK_KP_SPACE: SDL_KeyCode = 1073742029;
pub const SDLK_KP_AT: SDL_KeyCode = 1073742030;
pub const SDLK_KP_EXCLAM: SDL_KeyCode = 1073742031;
pub const SDLK_KP_MEMSTORE: SDL_KeyCode = 1073742032;
pub const SDLK_KP_MEMRECALL: SDL_KeyCode = 1073742033;
pub const SDLK_KP_MEMCLEAR: SDL_KeyCode = 1073742034;
pub const SDLK_KP_MEMADD: SDL_KeyCode = 1073742035;
pub const SDLK_KP_MEMSUBTRACT: SDL_KeyCode = 1073742036;
pub const SDLK_KP_MEMMULTIPLY: SDL_KeyCode = 1073742037;
pub const SDLK_KP_MEMDIVIDE: SDL_KeyCode = 1073742038;
pub const SDLK_KP_PLUSMINUS: SDL_KeyCode = 1073742039;
pub const SDLK_KP_CLEAR: SDL_KeyCode = 1073742040;
pub const SDLK_KP_CLEARENTRY: SDL_KeyCode = 1073742041;
pub const SDLK_KP_BINARY: SDL_KeyCode = 1073742042;
pub const SDLK_KP_OCTAL: SDL_KeyCode = 1073742043;
pub const SDLK_KP_DECIMAL: SDL_KeyCode = 1073742044;
pub const SDLK_KP_HEXADECIMAL: SDL_KeyCode = 1073742045;
pub const SDLK_LCTRL: SDL_KeyCode = 1073742048;
pub const SDLK_LSHIFT: SDL_KeyCode = 1073742049;
pub const SDLK_LALT: SDL_KeyCode = 1073742050;
pub const SDLK_LGUI: SDL_KeyCode = 1073742051;
pub const SDLK_RCTRL: SDL_KeyCode = 1073742052;
pub const SDLK_RSHIFT: SDL_KeyCode = 1073742053;
pub const SDLK_RALT: SDL_KeyCode = 1073742054;
pub const SDLK_RGUI: SDL_KeyCode = 1073742055;
pub const SDLK_MODE: SDL_KeyCode = 1073742081;
pub const SDLK_AUDIONEXT: SDL_KeyCode = 1073742082;
pub const SDLK_AUDIOPREV: SDL_KeyCode = 1073742083;
pub const SDLK_AUDIOSTOP: SDL_KeyCode = 1073742084;
pub const SDLK_AUDIOPLAY: SDL_KeyCode = 1073742085;
pub const SDLK_AUDIOMUTE: SDL_KeyCode = 1073742086;
pub const SDLK_MEDIASELECT: SDL_KeyCode = 1073742087;
pub const SDLK_WWW: SDL_KeyCode = 1073742088;
pub const SDLK_MAIL: SDL_KeyCode = 1073742089;
pub const SDLK_CALCULATOR: SDL_KeyCode = 1073742090;
pub const SDLK_COMPUTER: SDL_KeyCode = 1073742091;
pub const SDLK_AC_SEARCH: SDL_KeyCode = 1073742092;
pub const SDLK_AC_HOME: SDL_KeyCode = 1073742093;
pub const SDLK_AC_BACK: SDL_KeyCode = 1073742094;
pub const SDLK_AC_FORWARD: SDL_KeyCode = 1073742095;
pub const SDLK_AC_STOP: SDL_KeyCode = 1073742096;
pub const SDLK_AC_REFRESH: SDL_KeyCode = 1073742097;
pub const SDLK_AC_BOOKMARKS: SDL_KeyCode = 1073742098;
pub const SDLK_BRIGHTNESSDOWN: SDL_KeyCode = 1073742099;
pub const SDLK_BRIGHTNESSUP: SDL_KeyCode = 1073742100;
pub const SDLK_DISPLAYSWITCH: SDL_KeyCode = 1073742101;
pub const SDLK_KBDILLUMTOGGLE: SDL_KeyCode = 1073742102;
pub const SDLK_KBDILLUMDOWN: SDL_KeyCode = 1073742103;
pub const SDLK_KBDILLUMUP: SDL_KeyCode = 1073742104;
pub const SDLK_EJECT: SDL_KeyCode = 1073742105;
pub const SDLK_SLEEP: SDL_KeyCode = 1073742106;
pub const SDLK_APP1: SDL_KeyCode = 1073742107;
pub const SDLK_APP2: SDL_KeyCode = 1073742108;
pub const SDLK_AUDIOREWIND: SDL_KeyCode = 1073742109;
pub const SDLK_AUDIOFASTFORWARD: SDL_KeyCode = 1073742110;
pub type SDL_KeyCode = ctypes::c_uint;
pub const KMOD_NONE: SDL_Keymod = 0;
pub const KMOD_LSHIFT: SDL_Keymod = 1;
pub const KMOD_RSHIFT: SDL_Keymod = 2;
pub const KMOD_LCTRL: SDL_Keymod = 64;
pub const KMOD_RCTRL: SDL_Keymod = 128;
pub const KMOD_LALT: SDL_Keymod = 256;
pub const KMOD_RALT: SDL_Keymod = 512;
pub const KMOD_LGUI: SDL_Keymod = 1024;
pub const KMOD_RGUI: SDL_Keymod = 2048;
pub const KMOD_NUM: SDL_Keymod = 4096;
pub const KMOD_CAPS: SDL_Keymod = 8192;
pub const KMOD_MODE: SDL_Keymod = 16384;
pub const KMOD_RESERVED: SDL_Keymod = 32768;
pub const KMOD_CTRL: SDL_Keymod = 192;
pub const KMOD_SHIFT: SDL_Keymod = 3;
pub const KMOD_ALT: SDL_Keymod = 768;
pub const KMOD_GUI: SDL_Keymod = 3072;
pub type SDL_Keymod = ctypes::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Keysym {
    pub scancode: SDL_Scancode,
    pub sym: SDL_Keycode,
    pub mod_: Uint16,
    pub unused: Uint32,
}
#[test]
fn bindgen_test_layout_SDL_Keysym() {
    assert_eq!(
        ::core::mem::size_of::<SDL_Keysym>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_Keysym))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_Keysym>(),
        4usize,
        concat!("Alignment of ", stringify!(SDL_Keysym))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Keysym>())).scancode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Keysym),
            "::",
            stringify!(scancode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Keysym>())).sym as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Keysym),
            "::",
            stringify!(sym)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Keysym>())).mod_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Keysym),
            "::",
            stringify!(mod_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_Keysym>())).unused as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_Keysym),
            "::",
            stringify!(unused)
        )
    );
}
impl Default for SDL_Keysym {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SDL_GetKeyboardFocus() -> *mut SDL_Window;
}
extern "C" {
    pub fn SDL_GetKeyboardState(numkeys: *mut ctypes::c_int) -> *const Uint8;
}
extern "C" {
    pub fn SDL_GetModState() -> SDL_Keymod;
}
extern "C" {
    pub fn SDL_SetModState(modstate: SDL_Keymod);
}
extern "C" {
    pub fn SDL_GetKeyFromScancode(scancode: SDL_Scancode) -> SDL_Keycode;
}
extern "C" {
    pub fn SDL_GetScancodeFromKey(key: SDL_Keycode) -> SDL_Scancode;
}
extern "C" {
    pub fn SDL_GetScancodeName(scancode: SDL_Scancode) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_GetScancodeFromName(name: *const ctypes::c_char) -> SDL_Scancode;
}
extern "C" {
    pub fn SDL_GetKeyName(key: SDL_Keycode) -> *const ctypes::c_char;
}
extern "C" {
    pub fn SDL_GetKeyFromName(name: *const ctypes::c_char) -> SDL_Keycode;
}
extern "C" {
    pub fn SDL_StartTextInput();
}
extern "C" {
    pub fn SDL_IsTextInputActive() -> SDL_bool;
}
extern "C" {
    pub fn SDL_StopTextInput();
}
extern "C" {
    pub fn SDL_SetTextInputRect(rect: *mut SDL_Rect);
}
extern "C" {
    pub fn SDL_HasScreenKeyboardSupport() -> SDL_bool;
}
extern "C" {
    pub fn SDL_IsScreenKeyboardShown(window: *mut SDL_Window) -> SDL_bool;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SDL_Cursor {
    _unused: [u8; 0],
}
pub const SDL_SYSTEM_CURSOR_ARROW: SDL_SystemCursor = 0;
pub const SDL_SYSTEM_CURSOR_IBEAM: SDL_SystemCursor = 1;
pub const SDL_SYSTEM_CURSOR_WAIT: SDL_SystemCursor = 2;
pub const SDL_SYSTEM_CURSOR_CROSSHAIR: SDL_SystemCursor = 3;
pub const SDL_SYSTEM_CURSOR_WAITARROW: SDL_SystemCursor = 4;
pub const SDL_SYSTEM_CURSOR_SIZENWSE: SDL_SystemCursor = 5;
pub const SDL_SYSTEM_CURSOR_SIZENESW: SDL_SystemCursor = 6;
pub const SDL_SYSTEM_CURSOR_SIZEWE: SDL_SystemCursor = 7;
pub const SDL_SYSTEM_CURSOR_SIZENS: SDL_SystemCursor = 8;
pub const SDL_SYSTEM_CURSOR_SIZEALL: SDL_SystemCursor = 9;
pub const SDL_SYSTEM_CURSOR_NO: SDL_SystemCursor = 10;
pub const SDL_SYSTEM_CURSOR_HAND: SDL_SystemCursor = 11;
pub const SDL_NUM_SYSTEM_CURSORS: SDL_SystemCursor = 12;
pub type SDL_SystemCursor = ctypes::c_uint;
pub const SDL_MOUSEWHEEL_NORMAL: SDL_MouseWheelDirection = 0;
pub const SDL_MOUSEWHEEL_FLIPPED: SDL_MouseWheelDirection = 1;
pub type SDL_MouseWheelDirection = ctypes::c_uint;
extern "C" {
    pub fn SDL_GetMouseFocus() -> *mut SDL_Window;
}
extern "C" {
    pub fn SDL_GetMouseState(x: *mut ctypes::c_int, y: *mut ctypes::c_int) -> Uint32;
}
extern "C" {
    pub fn SDL_GetGlobalMouseState(x: *mut ctypes::c_int, y: *mut ctypes::c_int) -> Uint32;
}
extern "C" {
    pub fn SDL_GetRelativeMouseState(x: *mut ctypes::c_int, y: *mut ctypes::c_int) -> Uint32;
}
extern "C" {
    pub fn SDL_WarpMouseInWindow(window: *mut SDL_Window, x: ctypes::c_int, y: ctypes::c_int);
}
extern "C" {
    pub fn SDL_WarpMouseGlobal(x: ctypes::c_int, y: ctypes::c_int) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_SetRelativeMouseMode(enabled: SDL_bool) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_CaptureMouse(enabled: SDL_bool) -> ctypes::c_int;
}
extern "C" {
    pub fn SDL_GetRelativeMouseMode() -> SDL_bool;
}
extern "C" {
    pub fn SDL_CreateCursor(
        data: *const Uint8,
        mask: *const Uint8,
        w: ctypes::c_int,
        h: ctypes::c_int,
        hot_x: ctypes::c_int,
        hot_y: ctypes::c_int,
    ) -> *mut SDL_Cursor;
}
extern "C" {
    pub fn SDL_CreateColorCursor(
        surface: *mut SDL_Surface,
        hot_x: ctypes::c_int,
        hot_y: ctypes::c_int,
    ) -> *mut SDL_Cursor;
}
extern "C" {
    pub fn SDL_CreateSystemCursor(id: SDL_SystemCursor) -> *mut SDL_Cursor;
}
extern "C" {
    pub fn SDL_SetCursor(cursor: *mut SDL_Cursor);
}
extern "C" {
    pub fn SDL_GetCursor() -> *mut SDL_Cursor;
}
extern "C" {
    pub fn SDL_GetDefaultCursor() -> *mut SDL_Cursor;
}
extern "C" {
    pub fn SDL_FreeCursor(cursor: *mut SDL_Cursor);
}
extern "C" {
    pub fn SDL_ShowCursor(toggle: ctypes::c_int) -> ctypes::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SDL_Joystick {
    _unused: [u8; 0],
}
pub type SDL_Joystick = _SDL_Joystick;
#[repr(C)]
#[derive(Default, Copy, Clone)]
pub struct SDL_JoystickGUID {
    pub data: [Uint8; 16usize],
}
#[test]
fn bindgen_test_layout_SDL_JoystickGUID() {
    assert_eq!(
        ::core::mem::size_of::<SDL_JoystickGUID>(),
        16usize,
        concat!("Size of: ", stringify!(SDL_JoystickGUID))
    );
    assert_eq!(
        ::core::mem::align_of::<SDL_JoystickGUID>(),
        1usize,
        concat!("Alignment of ", stringify!(SDL_JoystickGUID))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SDL_JoystickGUID>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SDL_JoystickGUID),
            "::",
            stringify!(data)
        )
    );
}
pub type SDL_JoystickID = Sint32;
pub const SDL_JOYSTICK_TYPE_UNKNOWN: SDL_JoystickType = 0;
pub const SDL_JOYSTICK_TYPE_GAMECONTROLLER: SDL_JoystickType = 1;
pub const SDL_JOYSTICK_TYPE_WHEEL: SDL_JoystickType = 2;
pub const SDL_JOYSTICK_TYPE_ARCADE_STICK: SDL_JoystickType = 3;
pub const SDL_JOYSTICK_TYPE_FLIGHT_STICK: SDL_JoystickType = 4;
pub const SDL_JOYSTICK_TYPE_DANCE_PAD: SDL_JoystickType = 5;
pub const SDL_JOYSTICK_TYPE_GUITAR: SDL_JoystickType = 6;
pub const SDL_JOYSTICK_TYPE_DRUM_KIT: SDL_JoystickType = 7;
pub const SDL_JOYSTICK_TYPE_ARCADE_PAD: SDL_JoystickType = 8;
